{
  "ABOUT": "About",
  "ABOUT_HEADLINE": "I specialize in web development, building scalable and high-performance products with seamless user experiences.",
  "ABOUT_ME": "About Me",
  "ABOUT_SUPPORTING_TEXT": "With over four years of professional experience, I contribute to building reliable and efficient software solutions. My work has powered applications used by Fortune 500 companies, ensuring performance, scalability, and maintainability.",
  "APRIL_2025": "April 2025",
  "AR_LANG": "Arabic",
  "BACKEND": "Backend",
  "BACKEND_DESCRIPTION": "Skilled in RESTful API development, writing and optimizing complex SQL queries, and managing relational databases. Experienced in seamless integration between frontend and backend systems for high-performance applications.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Battery Manager Operations Display",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Programmed web app to display distribution centers’ battery maintenance activity. Runs on Raspberry Pi devices. Displays real-time battery maintenance activities for distribution centers in interactive graphs and tables.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Full stack development of web app for devices used by distribution center employees to maintain, track, and view statistics for industrial batteries. In use by several Fortune 500 companies.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Battery Manager Touch Computer Web App",
  "BN_LANG": "Bengali",
  "CI_CD_DESCRIPTION": "Skilled in streamlining deployment pipelines for scalable and efficient CI/CD solutions. Leveraging GitHub Actions to deploy and host React applications on Amazon S3, as well as implementing automated Jenkins pipelines integrated with Bitbucket to optimize firmware build, testing, and deployment workflows.",
  "CONTRACT_FIRMWARE_ENGINEER": "Contract Firmware Engineer",
  "CS_LANG": "Czech",
  "DA_LANG": "Danish",
  "DE_LANG": "German",
  "EGG_HARBOR_NJ_USA": "Egg Harbor Township, New Jersey, USA",
  "EL_LANG": "Greek",
  "EN_LANG": "English",
  "ES_LANG": "Spanish",
  "EXPERIENCE": "Experience",
  "FI_LANG": "Finnish",
  "FIRMWARE_UI_DEVELOPMENT": "Firmware UI Development",
  "FORT_COLLINS_COLORADO": "Fort Collins, Colorado",
  "FR_LANG": "French",
  "FRONTEND": "Frontend",
  "FRONTEND_DESCRIPTION": "Highly skilled in frontend development, web scripting, and UI engineering with deep expertise in managing complex, large-scale UI monorepos using React, TypeScript, JavaScript, and Lit frameworks. Led the design and delivery of multiple enterprise-grade applications currently in production across Fortune 500 companies.",
  "HACH_EXPERIENCE_1": "Maintain a large-scale TypeScript + Lit monorepo utilizing MVC and atomic UI architecture.",
  "HACH_EXPERIENCE_2": "Implement and manage UI submodules for several projects, supporting water analysis displays.",
  "HACH_EXPERIENCE_3": "Implemented custom ESLint rules and configurations, and developed Jest unit tests for UI components.",
  "HI_LANG": "Hindi",
  "HOME": "Home",
  "HU_LANG": "Hungarian",
  "ID_LANG": "Indonesian",
  "IT_LANG": "Italian",
  "JA_LANG": "Japanese",
  "JUNE_2021": "June 2021",
  "KO_LANG": "Korean",
  "LOVELAND_CO_USA": "Loveland, Colorado, USA",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pennsylvania, USA",
  "NL_LANG": "Dutch",
  "NO_LANG": "Norweigan",
  "PHLSCI_EXPERIENCE_1": "Design, develop, and test software components for Battery Manager systems.",
  "PHLSCI_EXPERIENCE_2": "Designing and developing web-based applications and GUIs used by distribution center employees for clients such as Target, Uline, and TJX.",
  "PHLSCI_EXPERIENCE_3": "Day to day support activities, resolving system bugs, assisting with customer/site questions.",
  "PL_LANG": "Polish",
  "PRESENT": "Present",
  "PROJECTS": "Projects",
  "PT_LANG": "Portuguese",
  "REGULUS_EXPERIENCE_1": "Upgraded user interface for both inputting data requests and outputting analytical results.",
  "REGULUS_EXPERIENCE_2": "Improved database efficiencies and turnaround times.",
  "REGULUS_EXPERIENCE_3": "Developed dashboard-style web pages showing overall real-time and historical system performance.",
  "RESUME": "Resume",
  "RO_LANG": "Romanian",
  "RU_LANG": "Russian",
  "SEPTEMBER_2022": "September 2022",
  "SOFTWARE_DEVELOPMENT": "Software Development",
  "SOFTWARE_ENGINEER": "Software Engineer",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Surveillance Spotlight Dashboard",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Software tool developed for the Federal Aviation Administration (FAA). The tool displays flight data from different data sources. Users can choose between daily and monthly data, and the data is populated into an interactive dashboard.",
  "SV_LANG": "Swedish",
  "TECH_STACK": "Tech Stack",
  "TH_LANG": "Thai",
  "TR_LANG": "Turkish",
  "UK_LANG": "Ukranian",
  "VI_LANG": "Vietnamese",
  "WATER_ANALYSIS_UI": "Water Analysis UI",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Implemented scalable, modular UI components using Atomic UI and Modular MVC architecture to support real-time water analysis and measurement visualization for internal engineers, lab technicians, and clients.",
  "WORK_EXPERIENCE": "Work Experience",
  "ZH_LANG": "Chinese"
}