{
  "ABOUT": "Over",
  "ABOUT_HEADLINE": "Ik ben gespecialiseerd in webontwikkeling en het bouwen van schaalbare en hoogwaardige producten met naadloze gebruikerservaringen.",
  "ABOUT_ME": "Over mij",
  "ABOUT_SUPPORTING_TEXT": "Met ruim vier jaar professionele ervaring draag ik bij aan het bouwen van betrouwbare en efficiënte softwareoplossingen. Mijn werk heeft toepassingen aangestuurd die door Fortune 500-bedrijven worden gebruikt, waardoor prestaties, schaalbaarheid en onderhoudbaarheid zijn gegarandeerd.",
  "APRIL_2025": "april 2025",
  "AR_LANG": "Arabisch",
  "BACKEND": "Achterkant",
  "BACKEND_DESCRIPTION": "Bekwaam in RESTful API-ontwikkeling, het schrijven en optimaliseren van complexe SQL-query's en het beheren van relationele databases. Ervaren in naadloze integratie tussen frontend en backend systemen voor krachtige applicaties.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Bedieningsdisplay batterijmanager",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Geprogrammeerde webapp om de batterijonderhoudsactiviteiten van distributiecentra weer te geven. Werkt op Raspberry Pi-apparaten. Geeft realtime batterijonderhoudsactiviteiten voor distributiecentra weer in interactieve grafieken en tabellen.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Volledige ontwikkeling van een webapp voor apparaten die door medewerkers van distributiecentra worden gebruikt om statistieken voor industriële batterijen bij te houden, bij te houden en te bekijken. In gebruik door verschillende Fortune 500-bedrijven.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Batterijbeheer Touch Computer Web-app",
  "BN_LANG": "Bengaals",
  "CI_CD_DESCRIPTION": "Bekwaam in het stroomlijnen van implementatiepijplijnen voor schaalbare en efficiënte CI/CD-oplossingen. Gebruikmaken van GitHub Actions voor het implementeren en hosten van React-applicaties op Amazon S3, en het implementeren van geautomatiseerde Jenkins-pijplijnen die zijn geïntegreerd met Bitbucket om de workflows voor het bouwen, testen en implementeren van firmware te optimaliseren.",
  "CONTRACT_FIRMWARE_ENGINEER": "Contractfirmware-ingenieur",
  "CS_LANG": "Tsjechisch",
  "DA_LANG": "Deens",
  "DE_LANG": "Duits",
  "EGG_HARBOR_NJ_USA": "Egg Harbor Township, New Jersey, VS",
  "EL_LANG": "Grieks",
  "EN_LANG": "Engels",
  "ES_LANG": "Spaans",
  "EXPERIENCE": "Ervaring",
  "FI_LANG": "Fins",
  "FIRMWARE_UI_DEVELOPMENT": "Firmware-UI-ontwikkeling",
  "FORT_COLLINS_COLORADO": "Fort Collins, Colorado",
  "FR_LANG": "Frans",
  "FRONTEND": "Frontend",
  "FRONTEND_DESCRIPTION": "Zeer bedreven in frontend-ontwikkeling, webscripting en UI-engineering met diepgaande expertise in het beheren van complexe, grootschalige UI-monorepo's met behulp van React-, TypeScript-, JavaScript- en Lit-frameworks. Leidde het ontwerp en de levering van meerdere bedrijfsapplicaties die momenteel in productie zijn bij Fortune 500-bedrijven.",
  "HACH_EXPERIENCE_1": "Onderhoud een grootschalige TypeScript + Lit monorepo met behulp van MVC en atomaire UI-architectuur.",
  "HACH_EXPERIENCE_2": "Implementeer en beheer UI-submodules voor verschillende projecten, ter ondersteuning van wateranalysedisplays.",
  "HACH_EXPERIENCE_3": "Implementeerde aangepaste ESLint-regels en -configuraties en ontwikkelde Jest-unittests voor UI-componenten.",
  "HI_LANG": "Hindi",
  "HOME": "Thuis",
  "HU_LANG": "Hongaars",
  "ID_LANG": "Indonesisch",
  "IT_LANG": "Italiaans",
  "JA_LANG": "Japanse",
  "JUNE_2021": "Juni 2021",
  "KO_LANG": "Koreaans",
  "LOVELAND_CO_USA": "Loveland, Colorado, VS",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pennsylvania, VS",
  "NL_LANG": "Nederlands",
  "NO_LANG": "Noors",
  "PHLSCI_EXPERIENCE_1": "Ontwerp, ontwikkel en test softwarecomponenten voor Battery Manager-systemen.",
  "PHLSCI_EXPERIENCE_2": "Ontwerpen en ontwikkelen van webgebaseerde applicaties en GUI's die worden gebruikt door distributiecentrummedewerkers voor klanten als Target, Uline en TJX.",
  "PHLSCI_EXPERIENCE_3": "Dagelijkse ondersteuningsactiviteiten, het oplossen van systeemfouten, het assisteren bij vragen van klanten/sites.",
  "PL_LANG": "Pools",
  "PRESENT": "Cadeau",
  "PROJECTS": "Projecten",
  "PT_LANG": "Portugees",
  "REGULUS_EXPERIENCE_1": "Verbeterde gebruikersinterface voor zowel het invoeren van gegevensverzoeken als het uitvoeren van analytische resultaten.",
  "REGULUS_EXPERIENCE_2": "Verbeterde database-efficiëntie en doorlooptijden.",
  "REGULUS_EXPERIENCE_3": "Ontwikkelde webpagina's in dashboardstijl die de algehele realtime en historische systeemprestaties weergeven.",
  "RESUME": "Cv",
  "RO_LANG": "Roemeense",
  "RU_LANG": "Russisch",
  "SEPTEMBER_2022": "September 2022",
  "SOFTWARE_DEVELOPMENT": "Softwareontwikkeling",
  "SOFTWARE_ENGINEER": "Software-ingenieur",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Spotlight-dashboard voor bewaking",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Softwaretool ontwikkeld voor de Federal Aviation Administration (FAA). De tool toont vluchtgegevens uit verschillende gegevensbronnen. Gebruikers kunnen kiezen tussen dagelijkse en maandelijkse gegevens, en de gegevens worden ingevuld in een interactief dashboard.",
  "SV_LANG": "Zweeds",
  "TECH_STACK": "Technische stapel",
  "TH_LANG": "Thais",
  "TR_LANG": "Turks",
  "UK_LANG": "Oekraïens",
  "VI_LANG": "Vietnamees",
  "WATER_ANALYSIS_UI": "UI voor wateranalyse",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Schaalbare, modulaire UI-componenten geïmplementeerd met behulp van Atomic UI en modulaire MVC-architectuur ter ondersteuning van realtime wateranalyse en meetvisualisatie voor interne ingenieurs, laboratoriumtechnici en klanten.",
  "WORK_EXPERIENCE": "Werkervaring",
  "ZH_LANG": "Chinese"
}