{
  "ABOUT": "Körülbelül",
  "ABOUT_HEADLINE": "Szakterületem a webfejlesztés, skálázható és nagy teljesítményű termékek zökkenőmentes felhasználói élményt nyújtó létrehozása.",
  "ABOUT_ME": "Rólam",
  "ABOUT_SUPPORTING_TEXT": "Több mint négy éves szakmai tapasztalattal hozzájárulok megbízható és hatékony szoftvermegoldások kiépítéséhez. Munkám a Fortune 500-as cégek által használt alkalmazásokhoz kapcsolódik, amelyek biztosítják a teljesítményt, a méretezhetőséget és a karbantarthatóságot.",
  "APRIL_2025": "2025. április",
  "AR_LANG": "arab",
  "BACKEND": "Háttérrendszer",
  "BACKEND_DESCRIPTION": "Jártas a RESTful API fejlesztésében, összetett SQL lekérdezések írásában és optimalizálásában, valamint relációs adatbázisok kezelésében. Tapasztalattal rendelkezik a frontend és a háttérrendszerek közötti zökkenőmentes integrációban a nagy teljesítményű alkalmazásokhoz.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Akkumulátorkezelő műveletek képernyője",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Programozott webalkalmazás az elosztóközpontok akkumulátor-karbantartási tevékenységének megjelenítésére. Raspberry Pi eszközökön fut. Interaktív grafikonokon és táblázatokban jeleníti meg az elosztóközpontok akkumulátor-karbantartási tevékenységeit.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Webes alkalmazás teljes körű fejlesztése az elosztóközpont alkalmazottai által az ipari akkumulátorok karbantartására, nyomon követésére és statisztikák megtekintéséhez használt eszközökhöz. Számos Fortune 500 vállalat használja.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Akkumulátorkezelő Érintse meg a Számítógépes webalkalmazást",
  "BN_LANG": "bengáli",
  "CI_CD_DESCRIPTION": "Jártas a telepítési folyamatok ésszerűsítésében a méretezhető és hatékony CI/CD megoldásokhoz. Használja ki a GitHub Actions-t a React-alkalmazások Amazon S3-on való üzembe helyezéséhez és hosztolásához, valamint a Bitbucket-be integrált automatizált Jenkins-folyamatok megvalósításához a firmware-készítés, -tesztelés és -telepítési munkafolyamatok optimalizálása érdekében.",
  "CONTRACT_FIRMWARE_ENGINEER": "Szerződéses firmware mérnök",
  "CS_LANG": "cseh",
  "DA_LANG": "dán",
  "DE_LANG": "német",
  "EGG_HARBOR_NJ_USA": "Egg Harbor Township, New Jersey, USA",
  "EL_LANG": "görög",
  "EN_LANG": "angol",
  "ES_LANG": "spanyol",
  "EXPERIENCE": "Tapasztalat",
  "FI_LANG": "finn",
  "FIRMWARE_UI_DEVELOPMENT": "Firmware UI fejlesztés",
  "FORT_COLLINS_COLORADO": "Fort Collins, Colorado",
  "FR_LANG": "francia",
  "FRONTEND": "Frontend",
  "FRONTEND_DESCRIPTION": "Magas szintű képzettséggel rendelkezik a frontend fejlesztésben, a webes parancsfájlok készítésében és a felhasználói felület tervezésében, mély szakértelemmel a React, TypeScript, JavaScript és Lit keretrendszereket használó összetett, nagyméretű felhasználói felület monorepók kezelésében. Vezetett több, jelenleg gyártásban lévő vállalati szintű alkalmazás tervezésében és szállításában a Fortune 500-as cégeknél.",
  "HACH_EXPERIENCE_1": "Fenntartson egy nagyméretű TypeScript + Lit monorepot az MVC és az atomic UI architektúrával.",
  "HACH_EXPERIENCE_2": "Vezessen be és kezeljen UI almodulokat több projekthez, amelyek támogatják a vízelemző kijelzőket.",
  "HACH_EXPERIENCE_3": "Egyéni ESLint szabályokat és konfigurációkat valósított meg, valamint Jest egységteszteket fejlesztett ki a felhasználói felület összetevőihez.",
  "HI_LANG": "hindi",
  "HOME": "Otthon",
  "HU_LANG": "magyar",
  "ID_LANG": "indonéz",
  "IT_LANG": "olasz",
  "JA_LANG": "japán",
  "JUNE_2021": "2021. június",
  "KO_LANG": "koreai",
  "LOVELAND_CO_USA": "Loveland, Colorado, USA",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pennsylvania, USA",
  "NL_LANG": "holland",
  "NO_LANG": "norvég",
  "PHLSCI_EXPERIENCE_1": "A Battery Manager rendszerek szoftverösszetevőinek tervezése, fejlesztése és tesztelése.",
  "PHLSCI_EXPERIENCE_2": "Webalapú alkalmazások és grafikus felhasználói felületek tervezése és fejlesztése, amelyeket az elosztóközpontok alkalmazottai használnak olyan ügyfelek számára, mint a Target, az Uline és a TJX.",
  "PHLSCI_EXPERIENCE_3": "Napi támogatási tevékenységek, rendszerhibák megoldása, ügyfél-/webhely-kérdések segítése.",
  "PL_LANG": "lengyel",
  "PRESENT": "Jelenlegi",
  "PROJECTS": "Projektek",
  "PT_LANG": "portugál",
  "REGULUS_EXPERIENCE_1": "Továbbfejlesztett felhasználói felület az adatkérések beviteléhez és az elemzési eredmények kiadásához.",
  "REGULUS_EXPERIENCE_2": "Jobb adatbázis-hatékonyság és átfutási idők.",
  "REGULUS_EXPERIENCE_3": "Fejlett irányítópult-szerű weboldalak, amelyek a rendszer általános valós idejű és történeti teljesítményét mutatják be.",
  "RESUME": "Folytatás",
  "RO_LANG": "román",
  "RU_LANG": "orosz",
  "SEPTEMBER_2022": "2022. szeptember",
  "SOFTWARE_DEVELOPMENT": "Szoftverfejlesztés",
  "SOFTWARE_ENGINEER": "Szoftvermérnök",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Surveillance Spotlight műszerfal",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "A Federal Aviation Administration (FAA) számára kifejlesztett szoftvereszköz. Az eszköz különböző adatforrásokból származó repülési adatokat jelenít meg. A felhasználók választhatnak a napi és a havi adatok között, az adatok pedig egy interaktív irányítópulton jelennek meg.",
  "SV_LANG": "svéd",
  "TECH_STACK": "Tech Stack",
  "TH_LANG": "thai",
  "TR_LANG": "török",
  "UK_LANG": "ukrán",
  "VI_LANG": "vietnami",
  "WATER_ANALYSIS_UI": "Vízelemzés UI",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Az Atomic UI és a Modular MVC architektúra segítségével skálázható, moduláris UI komponensek implementálása a valós idejű vízelemzés és mérési vizualizáció támogatására belső mérnökök, labortechnikusok és ügyfelek számára.",
  "WORK_EXPERIENCE": "Munkatapasztalat",
  "ZH_LANG": "kínai"
}