{
  "ABOUT": "Noin",
  "ABOUT_HEADLINE": "Olen erikoistunut verkkokehitykseen, skaalautuvien ja korkean suorituskyvyn tuotteiden rakentamiseen saumattomilla käyttökokemuksilla.",
  "ABOUT_ME": "Tietoja minusta",
  "ABOUT_SUPPORTING_TEXT": "Yli neljän vuoden ammattikokemuksella osallistun luotettavien ja tehokkaiden ohjelmistoratkaisujen rakentamiseen. Työni on tukenut Fortune 500 -yritysten käyttämiä sovelluksia, jotka varmistavat suorituskyvyn, skaalautuvuuden ja ylläpidettävyyden.",
  "APRIL_2025": "Huhtikuu 2025",
  "AR_LANG": "arabia",
  "BACKEND": "Backend",
  "BACKEND_DESCRIPTION": "Osaat RESTful API -kehityksen, monimutkaisten SQL-kyselyjen kirjoittamisen ja optimoinnin sekä relaatiotietokantojen hallinnan. Kokenut saumattomasta integraatiosta etu- ja taustajärjestelmien välillä korkean suorituskyvyn sovelluksissa.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Battery Manager -toimintojen näyttö",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Ohjelmoitu verkkosovellus näyttämään jakelukeskusten akun huoltotoimet. Toimii Raspberry Pi -laitteilla. Näyttää reaaliaikaiset akun huoltotoimet jakelukeskuksille interaktiivisissa kaavioissa ja taulukoissa.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Täysi pino verkkosovelluksen kehittäminen laitteille, joita jakelukeskuksen työntekijät käyttävät teollisuusakkujen ylläpitoon, seurantaan ja tilastojen katseluun. Useiden Fortune 500 -yritysten käytössä.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Battery Manager Kosketa Tietokoneen verkkosovellus",
  "BN_LANG": "bengali",
  "CI_CD_DESCRIPTION": "Taitava virtaviivaistamaan käyttöönottoputkia skaalautuvia ja tehokkaita CI/CD-ratkaisuja varten. GitHub Actionsin hyödyntäminen React-sovellusten käyttöönottoon ja isännöintiin Amazon S3:ssa sekä Bitbucketiin integroitujen automatisoitujen Jenkins-putkien käyttöönotto laiteohjelmiston rakentamisen, testauksen ja käyttöönoton työnkulkujen optimoimiseksi.",
  "CONTRACT_FIRMWARE_ENGINEER": "Sopimusohjelmistosuunnittelija",
  "CS_LANG": "Tšekki",
  "DA_LANG": "tanskalainen",
  "DE_LANG": "saksaksi",
  "EGG_HARBOR_NJ_USA": "Egg Harbor Township, New Jersey, Yhdysvallat",
  "EL_LANG": "kreikkalainen",
  "EN_LANG": "englanti",
  "ES_LANG": "espanja",
  "EXPERIENCE": "Kokea",
  "FI_LANG": "suomalainen",
  "FIRMWARE_UI_DEVELOPMENT": "Laiteohjelmiston käyttöliittymän kehittäminen",
  "FORT_COLLINS_COLORADO": "Fort Collins, Colorado",
  "FR_LANG": "ranskalainen",
  "FRONTEND": "Käyttöliittymä",
  "FRONTEND_DESCRIPTION": "Erittäin ammattitaitoinen käyttöliittymäkehityksessä, web-skriptauksessa ja käyttöliittymäsuunnittelussa, jolla on syvä asiantuntemus monimutkaisten, laajamittaisten käyttöliittymän monoreposen hallinnassa React-, TypeScript-, JavaScript- ja Lit-kehysten avulla. Johti useiden tällä hetkellä tuotannossa olevien yritystason sovellusten suunnittelua ja toimittamista Fortune 500 -yrityksissä.",
  "HACH_EXPERIENCE_1": "Ylläpidä laajamittaista TypeScript + Lit -monorepoa käyttämällä MVC:tä ja atomic UI -arkkitehtuuria.",
  "HACH_EXPERIENCE_2": "Toteuta ja hallitse käyttöliittymän alamoduuleja useille projekteille, jotka tukevat vesianalyysin näyttöjä.",
  "HACH_EXPERIENCE_3": "Oti käyttöön mukautettuja ESLint-sääntöjä ja -kokoonpanoja ja kehitti Jest-yksikkötestejä käyttöliittymäkomponenteille.",
  "HI_LANG": "hindi",
  "HOME": "Kotiin",
  "HU_LANG": "Unkari",
  "ID_LANG": "Indonesialainen",
  "IT_LANG": "italialainen",
  "JA_LANG": "japanilainen",
  "JUNE_2021": "Kesäkuu 2021",
  "KO_LANG": "korealainen",
  "LOVELAND_CO_USA": "Loveland, Colorado, Yhdysvallat",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pennsylvania, Yhdysvallat",
  "NL_LANG": "hollantilainen",
  "NO_LANG": "norjalainen",
  "PHLSCI_EXPERIENCE_1": "Suunnittele, kehitä ja testaa ohjelmistokomponentteja Battery Manager -järjestelmille.",
  "PHLSCI_EXPERIENCE_2": "Suunnittelemme ja kehitämme jakelukeskuksen työntekijöiden käyttämiä verkkopohjaisia ​​sovelluksia ja graafisia käyttöliittymiä asiakkaille, kuten Target, Uline ja TJX.",
  "PHLSCI_EXPERIENCE_3": "Päivittäiset tukitoiminnot, järjestelmävirheiden ratkaiseminen, avustaminen asiakkaiden/sivuston kysymyksissä.",
  "PL_LANG": "Kiillottaa",
  "PRESENT": "Esittää",
  "PROJECTS": "Projektit",
  "PT_LANG": "portugali",
  "REGULUS_EXPERIENCE_1": "Päivitetty käyttöliittymä sekä tietopyyntöjen syöttämiseen että analyyttisten tulosten tulostamiseen.",
  "REGULUS_EXPERIENCE_2": "Parannettu tietokannan tehokkuus ja läpimenoajat.",
  "REGULUS_EXPERIENCE_3": "Kehitetyt kojelautatyyliset verkkosivut, jotka näyttävät järjestelmän yleisen reaaliaikaisen ja historiallisen suorituskyvyn.",
  "RESUME": "Jatkaa",
  "RO_LANG": "romanialainen",
  "RU_LANG": "venäjäksi",
  "SEPTEMBER_2022": "Syyskuu 2022",
  "SOFTWARE_DEVELOPMENT": "Ohjelmistojen kehittäminen",
  "SOFTWARE_ENGINEER": "Ohjelmistoinsinööri",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Valvonta Spotlight Dashboard",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Federal Aviation Administrationille (FAA) kehitetty ohjelmistotyökalu. Työkalu näyttää lentotiedot eri tietolähteistä. Käyttäjät voivat valita päivittäisten tai kuukausittaisten tietojen välillä, ja tiedot kootaan interaktiiviseen kojelautaan.",
  "SV_LANG": "ruotsinkielinen",
  "TECH_STACK": "Tech Stack",
  "TH_LANG": "thaimaalainen",
  "TR_LANG": "turkkilainen",
  "UK_LANG": "ukrainalainen",
  "VI_LANG": "vietnam",
  "WATER_ANALYSIS_UI": "Vesianalyysin käyttöliittymä",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Toteutettu skaalattavat, modulaariset käyttöliittymäkomponentit käyttäen Atomic UI- ja Modular MVC -arkkitehtuuria tukemaan reaaliaikaista vesianalyysiä ja mittausten visualisointia sisäisille insinööreille, laboratorioteknikoille ja asiakkaille.",
  "WORK_EXPERIENCE": "Työkokemus",
  "ZH_LANG": "kiinalainen"
}