{
  "ABOUT": "О",
  "ABOUT_HEADLINE": "Я специализируюсь на веб-разработке, создании масштабируемых и высокопроизводительных продуктов с удобным пользовательским интерфейсом.",
  "ABOUT_ME": "Обо мне",
  "ABOUT_SUPPORTING_TEXT": "Имея более чем четырехлетний профессиональный опыт, я вношу свой вклад в создание надежных и эффективных программных решений. Моя работа легла в основу приложений, используемых компаниями из списка Fortune 500, обеспечивая производительность, масштабируемость и удобство обслуживания.",
  "APRIL_2025": "апрель 2025 г.",
  "AR_LANG": "арабский",
  "BACKEND": "Бэкэнд",
  "BACKEND_DESCRIPTION": "Имеет навыки разработки RESTful API, написания и оптимизации сложных SQL-запросов, а также управления реляционными базами данных. Имеет опыт бесшовной интеграции между интерфейсными и серверными системами для высокопроизводительных приложений.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Экран операций диспетчера батарей",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Запрограммированное веб-приложение для отображения операций по обслуживанию аккумуляторов в распределительных центрах. Работает на устройствах Raspberry Pi. Отображает действия по техническому обслуживанию аккумуляторов в распределительных центрах в режиме реального времени в интерактивных графиках и таблицах.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Полнофункциональная разработка веб-приложения для устройств, используемых сотрудниками распределительных центров для ведения, отслеживания и просмотра статистики промышленных аккумуляторов. Используется несколькими компаниями из списка Fortune 500.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Веб-приложение Battery Manager для сенсорного компьютера",
  "BN_LANG": "Бенгальский",
  "CI_CD_DESCRIPTION": "Имеет навыки оптимизации конвейеров развертывания масштабируемых и эффективных решений CI/CD. Использование GitHub Actions для развертывания и размещения приложений React на Amazon S3, а также внедрение автоматизированных конвейеров Jenkins, интегрированных с Bitbucket, для оптимизации рабочих процессов сборки, тестирования и развертывания прошивки.",
  "CONTRACT_FIRMWARE_ENGINEER": "Контрактный инженер по прошивке",
  "CS_LANG": "чешский",
  "DA_LANG": "датский",
  "DE_LANG": "немецкий",
  "EGG_HARBOR_NJ_USA": "Эгг-Харбор Тауншип, Нью-Джерси, США",
  "EL_LANG": "Греческий",
  "EN_LANG": "Английский",
  "ES_LANG": "испанский",
  "EXPERIENCE": "Опыт",
  "FI_LANG": "финский",
  "FIRMWARE_UI_DEVELOPMENT": "Разработка пользовательского интерфейса прошивки",
  "FORT_COLLINS_COLORADO": "Форт Коллинз, Колорадо",
  "FR_LANG": "Французский",
  "FRONTEND": "Внешний интерфейс",
  "FRONTEND_DESCRIPTION": "Обладает высокой квалификацией в области фронтенд-разработки, веб-скриптинга и проектирования пользовательского интерфейса, а также глубоким опытом управления сложными крупномасштабными монорепозиториями пользовательского интерфейса с использованием фреймворков React, TypeScript, JavaScript и Lit. Руководил разработкой и поставкой множества приложений корпоративного уровня, которые в настоящее время разрабатываются в компаниях из списка Fortune 500.",
  "HACH_EXPERIENCE_1": "Поддерживать крупномасштабный монорепозиторий TypeScript + Lit с использованием MVC и атомарной архитектуры пользовательского интерфейса.",
  "HACH_EXPERIENCE_2": "Внедряйте подмодули пользовательского интерфейса и управляйте ими для нескольких проектов, поддерживающих отображение анализа воды.",
  "HACH_EXPERIENCE_3": "Внедрил пользовательские правила и конфигурации ESLint, а также разработал модульные тесты Jest для компонентов пользовательского интерфейса.",
  "HI_LANG": "хинди",
  "HOME": "Дом",
  "HU_LANG": "венгерский",
  "ID_LANG": "индонезийский",
  "IT_LANG": "итальянский",
  "JA_LANG": "японский",
  "JUNE_2021": "июнь 2021 г.",
  "KO_LANG": "корейский",
  "LOVELAND_CO_USA": "Лавленд, Колорадо, США",
  "MONTGOMERYVILLE_PA_USA": "Монтгомеривилл, Пенсильвания, США",
  "NL_LANG": "Голландский",
  "NO_LANG": "норвежец",
  "PHLSCI_EXPERIENCE_1": "Проектируйте, разрабатывайте и тестируйте программные компоненты для систем Battery Manager.",
  "PHLSCI_EXPERIENCE_2": "Проектирование и разработка веб-приложений и графических интерфейсов, используемых сотрудниками распределительных центров для таких клиентов, как Target, Uline и TJX.",
  "PHLSCI_EXPERIENCE_3": "Повседневная поддержка, устранение системных ошибок, помощь в вопросах клиентов/сайтов.",
  "PL_LANG": "Польский",
  "PRESENT": "Подарок",
  "PROJECTS": "Проекты",
  "PT_LANG": "португальский",
  "REGULUS_EXPERIENCE_1": "Модернизированный пользовательский интерфейс для ввода запросов данных и вывода аналитических результатов.",
  "REGULUS_EXPERIENCE_2": "Повышена эффективность базы данных и время выполнения работ.",
  "REGULUS_EXPERIENCE_3": "Разработаны веб-страницы в виде информационной панели, показывающие общую производительность системы в реальном времени и за прошлые периоды.",
  "RESUME": "Резюме",
  "RO_LANG": "румынский",
  "RU_LANG": "Русский",
  "SEPTEMBER_2022": "сентябрь 2022 г.",
  "SOFTWARE_DEVELOPMENT": "Разработка программного обеспечения",
  "SOFTWARE_ENGINEER": "Инженер-программист",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Панель мониторинга наблюдения",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Программный инструмент, разработанный для Федерального авиационного управления (FAA). Инструмент отображает данные о полетах из разных источников данных. Пользователи могут выбирать между ежедневными и ежемесячными данными, и данные заполняются на интерактивной информационной панели.",
  "SV_LANG": "Шведский",
  "TECH_STACK": "Технический стек",
  "TH_LANG": "тайский",
  "TR_LANG": "турецкий",
  "UK_LANG": "украинский",
  "VI_LANG": "вьетнамский",
  "WATER_ANALYSIS_UI": "Пользовательский интерфейс анализа воды",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Реализованы масштабируемые модульные компоненты пользовательского интерфейса с использованием Atomic UI и модульной архитектуры MVC для поддержки анализа воды в реальном времени и визуализации измерений для внутренних инженеров, лаборантов и клиентов.",
  "WORK_EXPERIENCE": "Опыт работы",
  "ZH_LANG": "китайский"
}