{
  "ABOUT": "عن",
  "ABOUT_HEADLINE": "أنا متخصص في تطوير الويب، وبناء منتجات قابلة للتطوير وعالية الأداء مع تجارب مستخدم سلسة.",
  "ABOUT_ME": "ْعَنِّي",
  "ABOUT_SUPPORTING_TEXT": "مع أكثر من أربع سنوات من الخبرة المهنية، أساهم في بناء حلول برمجية موثوقة وفعالة. لقد دعم عملي التطبيقات التي تستخدمها شركات Fortune 500، مما يضمن الأداء وقابلية التوسع وقابلية الصيانة.",
  "APRIL_2025": "أبريل 2025",
  "AR_LANG": "عربي",
  "BACKEND": "الخلفية",
  "BACKEND_DESCRIPTION": "ماهر في تطوير RESTful API وكتابة استعلامات SQL المعقدة وتحسينها وإدارة قواعد البيانات العلائقية. من ذوي الخبرة في التكامل السلس بين أنظمة الواجهة الأمامية والخلفية للتطبيقات عالية الأداء.",
  "BATTERY_MANAGER_OPS_DISPLAY": "عرض عمليات مدير البطارية",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "تطبيق ويب مبرمج لعرض نشاط صيانة البطاريات في مراكز التوزيع. يعمل على أجهزة Raspberry Pi. يعرض أنشطة صيانة البطارية في الوقت الحقيقي لمراكز التوزيع في الرسوم البيانية والجداول التفاعلية.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "تطوير مكدس كامل لتطبيق الويب للأجهزة التي يستخدمها موظفو مركز التوزيع لصيانة وتتبع وعرض إحصائيات البطاريات الصناعية. قيد الاستخدام من قبل العديد من شركات Fortune 500.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "مدير البطارية المس تطبيق ويب للكمبيوتر",
  "BN_LANG": "البنغالية",
  "CI_CD_DESCRIPTION": "ماهر في تبسيط خطوط أنابيب النشر لحلول CI/CD القابلة للتطوير والفعالة. الاستفادة من إجراءات GitHub لنشر واستضافة تطبيقات React على Amazon S3، بالإضافة إلى تنفيذ خطوط أنابيب Jenkins الآلية المدمجة مع Bitbucket لتحسين بناء البرامج الثابتة واختبارها وسير عمل النشر.",
  "CONTRACT_FIRMWARE_ENGINEER": "مهندس البرامج الثابتة العقد",
  "CS_LANG": "التشيكية",
  "DA_LANG": "دانماركي",
  "DE_LANG": "الألمانية",
  "EGG_HARBOR_NJ_USA": "بلدة إيج هاربور، نيو جيرسي، الولايات المتحدة الأمريكية",
  "EL_LANG": "اليونانية",
  "EN_LANG": "إنجليزي",
  "ES_LANG": "الأسبانية",
  "EXPERIENCE": "خبرة",
  "FI_LANG": "الفنلندية",
  "FIRMWARE_UI_DEVELOPMENT": "تطوير واجهة المستخدم للبرامج الثابتة",
  "FORT_COLLINS_COLORADO": "(فورت كولينز، كولورادو).",
  "FR_LANG": "فرنسي",
  "FRONTEND": "الواجهة الأمامية",
  "FRONTEND_DESCRIPTION": "يتمتع بمهارة عالية في تطوير الواجهة الأمامية والبرمجة النصية للويب وهندسة واجهة المستخدم مع خبرة عميقة في إدارة عمليات واجهة المستخدم الأحادية المعقدة والواسعة النطاق باستخدام أطر عمل React وTypeScript وJavaScript وLit. قاد تصميم وتسليم العديد من التطبيقات على مستوى المؤسسات والتي يتم إنتاجها حاليًا عبر شركات Fortune 500.",
  "HACH_EXPERIENCE_1": "حافظ على TypeScript + Lit monorepo واسع النطاق باستخدام MVC وهندسة واجهة المستخدم الذرية.",
  "HACH_EXPERIENCE_2": "تنفيذ وإدارة الوحدات الفرعية لواجهة المستخدم للعديد من المشاريع، ودعم شاشات تحليل المياه.",
  "HACH_EXPERIENCE_3": "تم تنفيذ قواعد وتكوينات ESLint المخصصة، وتطوير اختبارات وحدة Jest لمكونات واجهة المستخدم.",
  "HI_LANG": "الهندية",
  "HOME": "بيت",
  "HU_LANG": "المجرية",
  "ID_LANG": "الاندونيسية",
  "IT_LANG": "ايطالي",
  "JA_LANG": "اليابانية",
  "JUNE_2021": "يونيو 2021",
  "KO_LANG": "كوري",
  "LOVELAND_CO_USA": "لوفلاند، كولورادو، الولايات المتحدة الأمريكية",
  "MONTGOMERYVILLE_PA_USA": "مونتغمريفيل، بنسيلفانيا، الولايات المتحدة",
  "NL_LANG": "هولندي",
  "NO_LANG": "النرويجي",
  "PHLSCI_EXPERIENCE_1": "تصميم وتطوير واختبار مكونات البرامج لأنظمة إدارة البطارية.",
  "PHLSCI_EXPERIENCE_2": "تصميم وتطوير التطبيقات المستندة إلى الويب وواجهات المستخدم الرسومية التي يستخدمها موظفو مركز التوزيع لعملاء مثل Target وUline وTJX.",
  "PHLSCI_EXPERIENCE_3": "أنشطة الدعم اليومية، وحل أخطاء النظام، والمساعدة في الإجابة على أسئلة العملاء/الموقع.",
  "PL_LANG": "بولندي",
  "PRESENT": "حاضر",
  "PROJECTS": "المشاريع",
  "PT_LANG": "البرتغالية",
  "REGULUS_EXPERIENCE_1": "ترقية واجهة المستخدم لكل من إدخال طلبات البيانات وإخراج النتائج التحليلية.",
  "REGULUS_EXPERIENCE_2": "تحسين كفاءة قاعدة البيانات وأوقات الاستجابة.",
  "REGULUS_EXPERIENCE_3": "تم تطوير صفحات ويب على طراز لوحة المعلومات تعرض الأداء العام للنظام في الوقت الفعلي والتاريخي.",
  "RESUME": "سيرة ذاتية",
  "RO_LANG": "روماني",
  "RU_LANG": "الروسية",
  "SEPTEMBER_2022": "سبتمبر 2022",
  "SOFTWARE_DEVELOPMENT": "تطوير البرمجيات",
  "SOFTWARE_ENGINEER": "مهندس البرمجيات",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "لوحة مراقبة أضواء كاشفة",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "أداة برمجية تم تطويرها لصالح إدارة الطيران الفيدرالية (FAA). تعرض الأداة بيانات الرحلة من مصادر بيانات مختلفة. يمكن للمستخدمين الاختيار بين البيانات اليومية والشهرية، ويتم تعبئة البيانات في لوحة معلومات تفاعلية.",
  "SV_LANG": "السويدية",
  "TECH_STACK": "مكدس التكنولوجيا",
  "TH_LANG": "التايلاندية",
  "TR_LANG": "تركي",
  "UK_LANG": "الأوكرانية",
  "VI_LANG": "الفيتنامية",
  "WATER_ANALYSIS_UI": "واجهة المستخدم لتحليل المياه",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "تم تنفيذ مكونات واجهة مستخدم معيارية قابلة للتطوير باستخدام بنية Atomic UI وModular MVC لدعم تحليل المياه في الوقت الفعلي وتصور القياس للمهندسين الداخليين وفنيي المختبرات والعملاء.",
  "WORK_EXPERIENCE": "خبرة في العمل",
  "ZH_LANG": "الصينية"
}