{
  "ABOUT": "Acerca de",
  "ABOUT_HEADLINE": "Me especializo en desarrollo web, creando productos escalables y de alto rendimiento con experiencias de usuario perfectas.",
  "ABOUT_ME": "Acerca de mí",
  "ABOUT_SUPPORTING_TEXT": "Con más de cuatro años de experiencia profesional, contribuyo a construir soluciones de software confiables y eficientes. Mi trabajo ha impulsado aplicaciones utilizadas por empresas Fortune 500, garantizando rendimiento, escalabilidad y mantenibilidad.",
  "APRIL_2025": "abril 2025",
  "AR_LANG": "árabe",
  "BACKEND": "backend",
  "BACKEND_DESCRIPTION": "Experto en desarrollo de API RESTful, redacción y optimización de consultas SQL complejas y gestión de bases de datos relacionales. Experiencia en integración perfecta entre sistemas frontend y backend para aplicaciones de alto rendimiento.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Pantalla de operaciones del administrador de batería",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Aplicación web programada para mostrar la actividad de mantenimiento de baterías de los centros de distribución. Se ejecuta en dispositivos Raspberry Pi. Muestra actividades de mantenimiento de baterías en tiempo real para centros de distribución en gráficos y tablas interactivas.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Desarrollo completo de una aplicación web para dispositivos utilizados por los empleados del centro de distribución para mantener, rastrear y ver estadísticas de baterías industriales. Utilizado por varias empresas Fortune 500.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Aplicación web para computadora táctil Battery Manager",
  "BN_LANG": "bengalí",
  "CI_CD_DESCRIPTION": "Experto en optimizar los procesos de implementación para soluciones CI/CD escalables y eficientes. Aprovechar GitHub Actions para implementar y alojar aplicaciones React en Amazon S3, así como implementar canalizaciones automatizadas de Jenkins integradas con Bitbucket para optimizar los flujos de trabajo de compilación, prueba e implementación de firmware.",
  "CONTRACT_FIRMWARE_ENGINEER": "Ingeniero de Firmware por contrato",
  "CS_LANG": "checo",
  "DA_LANG": "danés",
  "DE_LANG": "Alemán",
  "EGG_HARBOR_NJ_USA": "Municipio de Egg Harbor, Nueva Jersey, EE.UU.",
  "EL_LANG": "Griego",
  "EN_LANG": "Inglés",
  "ES_LANG": "Español",
  "EXPERIENCE": "Experiencia",
  "FI_LANG": "finlandés",
  "FIRMWARE_UI_DEVELOPMENT": "Desarrollo de interfaz de usuario de firmware",
  "FORT_COLLINS_COLORADO": "Fuerte Collins, Colorado",
  "FR_LANG": "Francés",
  "FRONTEND": "Interfaz",
  "FRONTEND_DESCRIPTION": "Altamente capacitado en desarrollo frontend, scripting web e ingeniería de UI con amplia experiencia en la gestión de monorepositorios de UI complejos y a gran escala utilizando marcos React, TypeScript, JavaScript y Lit. Lideró el diseño y la entrega de múltiples aplicaciones de nivel empresarial actualmente en producción en empresas Fortune 500.",
  "HACH_EXPERIENCE_1": "Mantenga un monorepo TypeScript + Lit a gran escala utilizando MVC y arquitectura de interfaz de usuario atómica.",
  "HACH_EXPERIENCE_2": "Implemente y administre submódulos de UI para varios proyectos, admitiendo pantallas de análisis de agua.",
  "HACH_EXPERIENCE_3": "Implementé reglas y configuraciones personalizadas de ESLint y desarrollé pruebas unitarias de Jest para componentes de UI.",
  "HI_LANG": "hindi",
  "HOME": "Hogar",
  "HU_LANG": "húngaro",
  "ID_LANG": "indonesio",
  "IT_LANG": "italiano",
  "JA_LANG": "japonés",
  "JUNE_2021": "junio 2021",
  "KO_LANG": "coreano",
  "LOVELAND_CO_USA": "Loveland, Colorado, EE.UU.",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pensilvania, EE.UU.",
  "NL_LANG": "Holandés",
  "NO_LANG": "noruego",
  "PHLSCI_EXPERIENCE_1": "Diseñar, desarrollar y probar componentes de software para sistemas Battery Manager.",
  "PHLSCI_EXPERIENCE_2": "Diseño y desarrollo de aplicaciones basadas en web y GUI utilizadas por empleados del centro de distribución para clientes como Target, Uline y TJX.",
  "PHLSCI_EXPERIENCE_3": "Actividades de soporte diarias, resolución de errores del sistema, asistencia con preguntas del cliente/sitio.",
  "PL_LANG": "Polaco",
  "PRESENT": "Presente",
  "PROJECTS": "Proyectos",
  "PT_LANG": "portugués",
  "REGULUS_EXPERIENCE_1": "Interfaz de usuario mejorada para ingresar solicitudes de datos y generar resultados analíticos.",
  "REGULUS_EXPERIENCE_2": "Mejora de la eficiencia de la base de datos y los tiempos de respuesta.",
  "REGULUS_EXPERIENCE_3": "Se desarrollaron páginas web estilo tablero que muestran el rendimiento histórico y general del sistema en tiempo real.",
  "RESUME": "Reanudar",
  "RO_LANG": "rumano",
  "RU_LANG": "ruso",
  "SEPTEMBER_2022": "Septiembre 2022",
  "SOFTWARE_DEVELOPMENT": "Desarrollo de software",
  "SOFTWARE_ENGINEER": "Ingeniero de software",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Panel de control de vigilancia",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Herramienta de software desarrollada para la Administración Federal de Aviación (FAA). La herramienta muestra datos de vuelo de diferentes fuentes de datos. Los usuarios pueden elegir entre datos diarios y mensuales, y los datos se completan en un panel interactivo.",
  "SV_LANG": "sueco",
  "TECH_STACK": "Pila de tecnología",
  "TH_LANG": "tailandés",
  "TR_LANG": "turco",
  "UK_LANG": "ucraniano",
  "VI_LANG": "vietnamita",
  "WATER_ANALYSIS_UI": "Interfaz de usuario de análisis de agua",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Implementé componentes de interfaz de usuario modulares y escalables utilizando la arquitectura Atomic UI y Modular MVC para respaldar el análisis de agua y la visualización de mediciones en tiempo real para ingenieros internos, técnicos de laboratorio y clientes.",
  "WORK_EXPERIENCE": "Experiencia laboral",
  "ZH_LANG": "Chino"
}