{
  "ABOUT": "Tentang",
  "ABOUT_HEADLINE": "Saya berspesialisasi dalam pengembangan web, membuat produk yang skalabel dan berkinerja tinggi dengan pengalaman pengguna yang lancar.",
  "ABOUT_ME": "Tentang Saya",
  "ABOUT_SUPPORTING_TEXT": "Dengan pengalaman profesional lebih dari empat tahun, saya berkontribusi dalam membangun solusi perangkat lunak yang andal dan efisien. Pekerjaan saya telah mendukung aplikasi yang digunakan oleh perusahaan-perusahaan Fortune 500, memastikan kinerja, skalabilitas, dan pemeliharaan.",
  "APRIL_2025": "April 2025",
  "AR_LANG": "Arab",
  "BACKEND": "Bagian belakang",
  "BACKEND_DESCRIPTION": "Terampil dalam pengembangan RESTful API, menulis dan mengoptimalkan kueri SQL yang kompleks, dan mengelola database relasional. Berpengalaman dalam integrasi tanpa batas antara sistem frontend dan backend untuk aplikasi berkinerja tinggi.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Tampilan Operasi Manajer Baterai",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Aplikasi web terprogram untuk menampilkan aktivitas pemeliharaan baterai pusat distribusi. Berjalan pada perangkat Raspberry Pi. Menampilkan aktivitas pemeliharaan baterai real-time untuk pusat distribusi dalam grafik dan tabel interaktif.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Pengembangan aplikasi web tumpukan penuh untuk perangkat yang digunakan oleh karyawan pusat distribusi untuk memelihara, melacak, dan melihat statistik baterai industri. Digunakan oleh beberapa perusahaan Fortune 500.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Manajer Baterai Sentuh Aplikasi Web Komputer",
  "BN_LANG": "Benggala",
  "CI_CD_DESCRIPTION": "Terampil dalam menyederhanakan jalur penerapan untuk solusi CI/CD yang skalabel dan efisien. Memanfaatkan GitHub Actions untuk menerapkan dan menghosting aplikasi React di Amazon S3, serta mengimplementasikan pipeline Jenkins otomatis yang terintegrasi dengan Bitbucket untuk mengoptimalkan alur kerja pembuatan, pengujian, dan penerapan firmware.",
  "CONTRACT_FIRMWARE_ENGINEER": "Insinyur Firmware Kontrak",
  "CS_LANG": "Ceko",
  "DA_LANG": "Denmark",
  "DE_LANG": "Jerman",
  "EGG_HARBOR_NJ_USA": "Kotapraja Egg Harbor, New Jersey, AS",
  "EL_LANG": "Orang yunani",
  "EN_LANG": "Bahasa inggris",
  "ES_LANG": "Spanyol",
  "EXPERIENCE": "Pengalaman",
  "FI_LANG": "Finlandia",
  "FIRMWARE_UI_DEVELOPMENT": "Pengembangan UI Firmware",
  "FORT_COLLINS_COLORADO": "Benteng Collins, Colorado",
  "FR_LANG": "Perancis",
  "FRONTEND": "Bagian depan",
  "FRONTEND_DESCRIPTION": "Sangat ahli dalam pengembangan frontend, pembuatan skrip web, dan rekayasa UI dengan keahlian mendalam dalam mengelola monorepo UI yang kompleks dan berskala besar menggunakan kerangka kerja React, TypeScript, JavaScript, dan Lit. Memimpin desain dan pengiriman beberapa aplikasi tingkat perusahaan yang saat ini diproduksi di perusahaan-perusahaan Fortune 500.",
  "HACH_EXPERIENCE_1": "Pertahankan monorepo TypeScript + Lit skala besar yang memanfaatkan arsitektur MVC dan UI atom.",
  "HACH_EXPERIENCE_2": "Menerapkan dan mengelola submodul UI untuk beberapa proyek, mendukung tampilan analisis air.",
  "HACH_EXPERIENCE_3": "Menerapkan aturan dan konfigurasi ESLint khusus, dan mengembangkan pengujian unit Jest untuk komponen UI.",
  "HI_LANG": "Hindi",
  "HOME": "Rumah",
  "HU_LANG": "Hongaria",
  "ID_LANG": "Indonesia",
  "IT_LANG": "Italia",
  "JA_LANG": "Jepang",
  "JUNE_2021": "Juni 2021",
  "KO_LANG": "Korea",
  "LOVELAND_CO_USA": "Loveland, Colorado, AS",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pennsylvania, AS",
  "NL_LANG": "Belanda",
  "NO_LANG": "Norwegia",
  "PHLSCI_EXPERIENCE_1": "Merancang, mengembangkan, dan menguji komponen perangkat lunak untuk sistem Manajer Baterai.",
  "PHLSCI_EXPERIENCE_2": "Merancang dan mengembangkan aplikasi berbasis web dan GUI yang digunakan oleh karyawan pusat distribusi untuk klien seperti Target, Uline, dan TJX.",
  "PHLSCI_EXPERIENCE_3": "Aktivitas dukungan sehari-hari, menyelesaikan bug sistem, membantu menjawab pertanyaan pelanggan/situs.",
  "PL_LANG": "Polandia",
  "PRESENT": "Hadiah",
  "PROJECTS": "Proyek",
  "PT_LANG": "Portugis",
  "REGULUS_EXPERIENCE_1": "Antarmuka pengguna yang ditingkatkan untuk memasukkan permintaan data dan mengeluarkan hasil analisis.",
  "REGULUS_EXPERIENCE_2": "Peningkatan efisiensi basis data dan waktu penyelesaian.",
  "REGULUS_EXPERIENCE_3": "Halaman web bergaya dasbor yang dikembangkan menunjukkan kinerja sistem secara real-time dan historis secara keseluruhan.",
  "RESUME": "Melanjutkan",
  "RO_LANG": "Rumania",
  "RU_LANG": "Rusia",
  "SEPTEMBER_2022": "September 2022",
  "SOFTWARE_DEVELOPMENT": "Pengembangan Perangkat Lunak",
  "SOFTWARE_ENGINEER": "Insinyur Perangkat Lunak",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Dasbor Sorotan Pengawasan",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Alat perangkat lunak yang dikembangkan untuk Federal Aviation Administration (FAA). Alat ini menampilkan data penerbangan dari berbagai sumber data. Pengguna dapat memilih antara data harian dan bulanan, dan data tersebut diisi ke dalam dasbor interaktif.",
  "SV_LANG": "Swedia",
  "TECH_STACK": "Tumpukan Teknologi",
  "TH_LANG": "Thai",
  "TR_LANG": "Turki",
  "UK_LANG": "Ukraina",
  "VI_LANG": "Vietnam",
  "WATER_ANALYSIS_UI": "UI Analisis Air",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Menerapkan komponen UI modular yang skalabel menggunakan arsitektur Atomic UI dan Modular MVC untuk mendukung analisis air real-time dan visualisasi pengukuran untuk teknisi internal, teknisi laboratorium, dan klien.",
  "WORK_EXPERIENCE": "Pengalaman Kerja",
  "ZH_LANG": "Cina"
}