{
  "ABOUT": "সম্পর্কে",
  "ABOUT_HEADLINE": "আমি ওয়েব ডেভেলপমেন্টে বিশেষজ্ঞ, সীমাহীন ব্যবহারকারীর অভিজ্ঞতা সহ মাপযোগ্য এবং উচ্চ-কার্যক্ষমতার পণ্য তৈরি করি।",
  "ABOUT_ME": "আমার সম্পর্কে",
  "ABOUT_SUPPORTING_TEXT": "চার বছরের বেশি পেশাদার অভিজ্ঞতার সাথে, আমি নির্ভরযোগ্য এবং দক্ষ সফ্টওয়্যার সমাধান তৈরিতে অবদান রাখি। আমার কাজ Fortune 500 কোম্পানি দ্বারা ব্যবহৃত অ্যাপ্লিকেশন চালিত করেছে, কর্মক্ষমতা, মাপযোগ্যতা এবং রক্ষণাবেক্ষণযোগ্যতা নিশ্চিত করে।",
  "APRIL_2025": "এপ্রিল 2025",
  "AR_LANG": "আরবি",
  "BACKEND": "ব্যাকএন্ড",
  "BACKEND_DESCRIPTION": "RESTful API ডেভেলপমেন্ট, জটিল এসকিউএল কোয়েরি লেখা ও অপ্টিমাইজ করা এবং রিলেশনাল ডাটাবেস পরিচালনায় দক্ষ। উচ্চ-পারফরম্যান্স অ্যাপ্লিকেশনের জন্য ফ্রন্টএন্ড এবং ব্যাকএন্ড সিস্টেমের মধ্যে বিরামহীন ইন্টিগ্রেশনে অভিজ্ঞ।",
  "BATTERY_MANAGER_OPS_DISPLAY": "ব্যাটারি ম্যানেজার অপারেশন ডিসপ্লে",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "বিতরণ কেন্দ্রের ব্যাটারি রক্ষণাবেক্ষণ কার্যকলাপ প্রদর্শনের জন্য প্রোগ্রাম করা ওয়েব অ্যাপ। রাস্পবেরি পাই ডিভাইসে চলে। ইন্টারেক্টিভ গ্রাফ এবং টেবিলে বিতরণ কেন্দ্রের জন্য রিয়েল-টাইম ব্যাটারি রক্ষণাবেক্ষণ কার্যক্রম প্রদর্শন করে।",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "শিল্প ব্যাটারির পরিসংখ্যান রক্ষণাবেক্ষণ, ট্র্যাক এবং দেখার জন্য বিতরণ কেন্দ্রের কর্মীদের দ্বারা ব্যবহৃত ডিভাইসগুলির জন্য ওয়েব অ্যাপের সম্পূর্ণ স্ট্যাক বিকাশ। বেশ কয়েকটি ফরচুন 500 কোম্পানি ব্যবহার করছে।",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "ব্যাটারি ম্যানেজার টাচ কম্পিউটার ওয়েব অ্যাপ",
  "BN_LANG": "বাংলা",
  "CI_CD_DESCRIPTION": "স্কেলযোগ্য এবং দক্ষ CI/CD সমাধানগুলির জন্য স্থাপনার পাইপলাইনগুলিকে স্ট্রিমলাইন করতে দক্ষ। Amazon S3-তে রিঅ্যাক্ট অ্যাপ্লিকেশন স্থাপন ও হোস্ট করার জন্য GitHub অ্যাকশনের ব্যবহার, সেইসাথে ফার্মওয়্যার বিল্ড, টেস্টিং এবং ডিপ্লয়মেন্ট ওয়ার্কফ্লো অপ্টিমাইজ করার জন্য বিটবাকেটের সাথে একীভূত স্বয়ংক্রিয় জেনকিন্স পাইপলাইন বাস্তবায়ন করা।",
  "CONTRACT_FIRMWARE_ENGINEER": "কন্ট্রাক্ট ফার্মওয়্যার ইঞ্জিনিয়ার",
  "CS_LANG": "চেক",
  "DA_LANG": "ড্যানিশ",
  "DE_LANG": "জার্মান",
  "EGG_HARBOR_NJ_USA": "এগ হারবার টাউনশিপ, নিউ জার্সি, মার্কিন যুক্তরাষ্ট্র",
  "EL_LANG": "গ্রীক",
  "EN_LANG": "ইংরেজি",
  "ES_LANG": "স্প্যানিশ",
  "EXPERIENCE": "অভিজ্ঞতা",
  "FI_LANG": "ফিনিশ",
  "FIRMWARE_UI_DEVELOPMENT": "ফার্মওয়্যার ইউআই ডেভেলপমেন্ট",
  "FORT_COLLINS_COLORADO": "ফোর্ট কলিন্স, কলোরাডো",
  "FR_LANG": "ফরাসি",
  "FRONTEND": "ফ্রন্টেন্ড",
  "FRONTEND_DESCRIPTION": "রিঅ্যাক্ট, টাইপস্ক্রিপ্ট, জাভাস্ক্রিপ্ট এবং লিট ফ্রেমওয়ার্ক ব্যবহার করে জটিল, বৃহৎ-স্কেল UI মনোরেপোস পরিচালনায় গভীর দক্ষতার সাথে ফ্রন্টএন্ড ডেভেলপমেন্ট, ওয়েব স্ক্রিপ্টিং এবং UI ইঞ্জিনিয়ারিংয়ে অত্যন্ত দক্ষ। Fortune 500 কোম্পানি জুড়ে বর্তমানে উৎপাদনে থাকা একাধিক এন্টারপ্রাইজ-গ্রেড অ্যাপ্লিকেশনের ডিজাইন এবং ডেলিভারির নেতৃত্ব দিয়েছেন।",
  "HACH_EXPERIENCE_1": "MVC এবং পারমাণবিক UI আর্কিটেকচার ব্যবহার করে একটি বড় মাপের TypeScript + Lit monorepo বজায় রাখুন।",
  "HACH_EXPERIENCE_2": "জল বিশ্লেষণ প্রদর্শন সমর্থন করে, বেশ কয়েকটি প্রকল্পের জন্য UI সাবমডিউলগুলি বাস্তবায়ন এবং পরিচালনা করুন।",
  "HACH_EXPERIENCE_3": "কাস্টম ESLint নিয়ম এবং কনফিগারেশন প্রয়োগ করা হয়েছে, এবং UI উপাদানগুলির জন্য জেস্ট ইউনিট পরীক্ষা তৈরি করেছে।",
  "HI_LANG": "হিন্দি",
  "HOME": "বাড়ি",
  "HU_LANG": "হাঙ্গেরিয়ান",
  "ID_LANG": "ইন্দোনেশিয়ান",
  "IT_LANG": "ইতালীয়",
  "JA_LANG": "জাপানিজ",
  "JUNE_2021": "জুন 2021",
  "KO_LANG": "কোরিয়ান",
  "LOVELAND_CO_USA": "লাভল্যান্ড, কলোরাডো, মার্কিন যুক্তরাষ্ট্র",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pennsylvania, USA",
  "NL_LANG": "ডাচ",
  "NO_LANG": "নরওয়েগান",
  "PHLSCI_EXPERIENCE_1": "ব্যাটারি ম্যানেজার সিস্টেমের জন্য সফ্টওয়্যার উপাদানগুলি ডিজাইন, বিকাশ এবং পরীক্ষা করুন।",
  "PHLSCI_EXPERIENCE_2": "টার্গেট, ইউলাইন এবং টিজেএক্স-এর মতো ক্লায়েন্টদের জন্য বিতরণ কেন্দ্রের কর্মচারীদের দ্বারা ব্যবহৃত ওয়েব-ভিত্তিক অ্যাপ্লিকেশন এবং GUI ডিজাইন এবং বিকাশ করা।",
  "PHLSCI_EXPERIENCE_3": "প্রতিদিনের সহায়তা কার্যক্রম, সিস্টেমের ত্রুটিগুলি সমাধান করা, গ্রাহক/সাইটের প্রশ্নের সাথে সহায়তা করা।",
  "PL_LANG": "পোলিশ",
  "PRESENT": "বর্তমান",
  "PROJECTS": "প্রকল্প",
  "PT_LANG": "পর্তুগিজ",
  "REGULUS_EXPERIENCE_1": "ইনপুট ডেটা অনুরোধ এবং বিশ্লেষণাত্মক ফলাফল আউটপুট উভয়ের জন্য আপগ্রেড ইউজার ইন্টারফেস।",
  "REGULUS_EXPERIENCE_2": "উন্নত ডাটাবেস দক্ষতা এবং টার্নআরাউন্ড সময়।",
  "REGULUS_EXPERIENCE_3": "ডেভলপ করা ড্যাশবোর্ড-স্টাইল ওয়েব পেজ সামগ্রিক রিয়েল-টাইম এবং ঐতিহাসিক সিস্টেম কর্মক্ষমতা দেখায়।",
  "RESUME": "পুনরায় শুরু করুন",
  "RO_LANG": "রোমানিয়ান",
  "RU_LANG": "রাশিয়ান",
  "SEPTEMBER_2022": "সেপ্টেম্বর 2022",
  "SOFTWARE_DEVELOPMENT": "সফটওয়্যার ডেভেলপমেন্ট",
  "SOFTWARE_ENGINEER": "সফটওয়্যার ইঞ্জিনিয়ার",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "নজরদারি স্পটলাইট ড্যাশবোর্ড",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "ফেডারেল এভিয়েশন অ্যাডমিনিস্ট্রেশন (FAA) এর জন্য সফটওয়্যার টুল তৈরি করা হয়েছে। টুলটি বিভিন্ন ডেটা উৎস থেকে ফ্লাইট ডেটা প্রদর্শন করে। ব্যবহারকারীরা দৈনিক এবং মাসিক ডেটার মধ্যে বেছে নিতে পারেন এবং ডেটা একটি ইন্টারেক্টিভ ড্যাশবোর্ডে জমা হয়।",
  "SV_LANG": "সুইডিশ",
  "TECH_STACK": "টেক স্ট্যাক",
  "TH_LANG": "থাই",
  "TR_LANG": "তুর্কি",
  "UK_LANG": "ইউক্রেনিয়ান",
  "VI_LANG": "ভিয়েতনামী",
  "WATER_ANALYSIS_UI": "জল বিশ্লেষণ UI",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "অভ্যন্তরীণ প্রকৌশলী, ল্যাব টেকনিশিয়ান এবং ক্লায়েন্টদের জন্য রিয়েল-টাইম জল বিশ্লেষণ এবং পরিমাপ ভিজ্যুয়ালাইজেশন সমর্থন করতে পারমাণবিক UI এবং মডুলার MVC আর্কিটেকচার ব্যবহার করে স্কেলেবল, মডুলার UI উপাদানগুলি প্রয়োগ করা হয়েছে।",
  "WORK_EXPERIENCE": "কাজের অভিজ্ঞতা",
  "ZH_LANG": "চাইনিজ"
}