{
  "ABOUT": "Om",
  "ABOUT_HEADLINE": "Jag är specialiserad på webbutveckling, att bygga skalbara och högpresterande produkter med sömlösa användarupplevelser.",
  "ABOUT_ME": "Om mig",
  "ABOUT_SUPPORTING_TEXT": "Med över fyra års yrkeserfarenhet bidrar jag till att bygga tillförlitliga och effektiva mjukvarulösningar. Mitt arbete har drivit applikationer som används av Fortune 500-företag, vilket säkerställer prestanda, skalbarhet och underhållsbarhet.",
  "APRIL_2025": "april 2025",
  "AR_LANG": "arabiska",
  "BACKEND": "Backend",
  "BACKEND_DESCRIPTION": "Skicklig i RESTful API-utveckling, skriva och optimera komplexa SQL-frågor och hantera relationsdatabaser. Erfaren av sömlös integration mellan frontend- och backendsystem för högpresterande applikationer.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Battery Manager Operations Display",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Programmerad webbapp för att visa distributionscenters batteriunderhållsaktivitet. Körs på Raspberry Pi-enheter. Visar batteriunderhållsaktiviteter i realtid för distributionscenter i interaktiva grafer och tabeller.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Fullstackutveckling av webbapp för enheter som används av distributionscenteranställda för att underhålla, spåra och visa statistik för industribatterier. Används av flera Fortune 500-företag.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Battery Manager Tryck på Computer Web App",
  "BN_LANG": "bengaliska",
  "CI_CD_DESCRIPTION": "Skicklig på att effektivisera distributionspipelines för skalbara och effektiva CI/CD-lösningar. Utnyttja GitHub Actions för att distribuera och vara värd för React-applikationer på Amazon S3, samt implementera automatiserade Jenkins-pipelines integrerade med Bitbucket för att optimera firmware-byggande, testning och distributionsarbetsflöden.",
  "CONTRACT_FIRMWARE_ENGINEER": "Kontraktstekniker för firmware",
  "CS_LANG": "tjeckiska",
  "DA_LANG": "danska",
  "DE_LANG": "tyska",
  "EGG_HARBOR_NJ_USA": "Egg Harbor Township, New Jersey, USA",
  "EL_LANG": "grekiska",
  "EN_LANG": "engelska",
  "ES_LANG": "spanska",
  "EXPERIENCE": "Uppleva",
  "FI_LANG": "finska",
  "FIRMWARE_UI_DEVELOPMENT": "Utveckling av firmware UI",
  "FORT_COLLINS_COLORADO": "Fort Collins, Colorado",
  "FR_LANG": "franska",
  "FRONTEND": "Frontend",
  "FRONTEND_DESCRIPTION": "Mycket skicklig inom frontend-utveckling, webbskript och UI-teknik med djup expertis i att hantera komplexa, storskaliga UI-monorepos med hjälp av React, TypeScript, JavaScript och Lit-ramverk. Ledde designen och leveransen av flera applikationer av företagsklass som för närvarande är i produktion i Fortune 500-företag.",
  "HACH_EXPERIENCE_1": "Upprätthåll en storskalig TypeScript + Lit monorepo med MVC och atomic UI-arkitektur.",
  "HACH_EXPERIENCE_2": "Implementera och hantera UI-undermoduler för flera projekt, med stöd för vattenanalysskärmar.",
  "HACH_EXPERIENCE_3": "Implementerade anpassade ESLint-regler och -konfigurationer och utvecklade Jest-enhetstester för UI-komponenter.",
  "HI_LANG": "hindi",
  "HOME": "Hem",
  "HU_LANG": "ungerska",
  "ID_LANG": "indonesiska",
  "IT_LANG": "italienska",
  "JA_LANG": "japanska",
  "JUNE_2021": "juni 2021",
  "KO_LANG": "koreanska",
  "LOVELAND_CO_USA": "Loveland, Colorado, USA",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pennsylvania, USA",
  "NL_LANG": "holländska",
  "NO_LANG": "norska",
  "PHLSCI_EXPERIENCE_1": "Designa, utveckla och testa mjukvarukomponenter för Battery Manager-system.",
  "PHLSCI_EXPERIENCE_2": "Designa och utveckla webbaserade applikationer och GUI som används av distributionscenteranställda för kunder som Target, Uline och TJX.",
  "PHLSCI_EXPERIENCE_3": "Dag till dag supportaktiviteter, lösa systembuggar, hjälpa till med kund-/sajtfrågor.",
  "PL_LANG": "polska",
  "PRESENT": "Presentera",
  "PROJECTS": "Projekt",
  "PT_LANG": "portugisiska",
  "REGULUS_EXPERIENCE_1": "Uppgraderat användargränssnitt för både inmatning av dataförfrågningar och utmatning av analytiska resultat.",
  "REGULUS_EXPERIENCE_2": "Förbättrad databaseffektivitet och handläggningstider.",
  "REGULUS_EXPERIENCE_3": "Utvecklade webbsidor i instrumentpanelstil som visar övergripande systemprestanda i realtid och historiskt.",
  "RESUME": "Resume",
  "RO_LANG": "rumänska",
  "RU_LANG": "ryska",
  "SEPTEMBER_2022": "september 2022",
  "SOFTWARE_DEVELOPMENT": "Mjukvaruutveckling",
  "SOFTWARE_ENGINEER": "Mjukvaruingenjör",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Övervakning Spotlight Dashboard",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Mjukvaruverktyg utvecklat för Federal Aviation Administration (FAA). Verktyget visar flygdata från olika datakällor. Användare kan välja mellan dagliga och månatliga data, och data fylls i i en interaktiv instrumentpanel.",
  "SV_LANG": "svenska",
  "TECH_STACK": "Tech Stack",
  "TH_LANG": "Thai",
  "TR_LANG": "turkiska",
  "UK_LANG": "ukrainska",
  "VI_LANG": "vietnamesiska",
  "WATER_ANALYSIS_UI": "Vattenanalys UI",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Implementerade skalbara, modulära UI-komponenter med Atomic UI och Modular MVC-arkitektur för att stödja vattenanalys och mätvisualisering i realtid för interna ingenjörer, labbtekniker och kunder.",
  "WORK_EXPERIENCE": "Arbetslivserfarenhet",
  "ZH_LANG": "kinesiska"
}