{
  "ABOUT": "À propos",
  "ABOUT_HEADLINE": "Je me spécialise dans le développement Web, en créant des produits évolutifs et performants avec des expériences utilisateur fluides.",
  "ABOUT_ME": "Sur moi",
  "ABOUT_SUPPORTING_TEXT": "Avec plus de quatre années d'expérience professionnelle, je contribue à construire des solutions logicielles fiables et efficaces. Mon travail a alimenté des applications utilisées par des entreprises Fortune 500, garantissant performances, évolutivité et maintenabilité.",
  "APRIL_2025": "avril 2025",
  "AR_LANG": "arabe",
  "BACKEND": "Back-end",
  "BACKEND_DESCRIPTION": "Compétent dans le développement d'API RESTful, l'écriture et l'optimisation de requêtes SQL complexes et la gestion de bases de données relationnelles. Expérience dans l'intégration transparente entre les systèmes frontend et backend pour des applications hautes performances.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Affichage des opérations du gestionnaire de batterie",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Application Web programmée pour afficher l’activité de maintenance des batteries des centres de distribution. Fonctionne sur les appareils Raspberry Pi. Affiche les activités de maintenance des batteries en temps réel pour les centres de distribution sous forme de graphiques et de tableaux interactifs.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Développement complet d'une application Web pour les appareils utilisés par les employés des centres de distribution pour maintenir, suivre et afficher les statistiques des batteries industrielles. Utilisé par plusieurs sociétés Fortune 500.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Application Web pour ordinateur tactile Battery Manager",
  "BN_LANG": "bengali",
  "CI_CD_DESCRIPTION": "Compétent dans la rationalisation des pipelines de déploiement pour des solutions CI/CD évolutives et efficaces. Tirer parti des actions GitHub pour déployer et héberger des applications React sur Amazon S3, ainsi que mettre en œuvre des pipelines Jenkins automatisés intégrés à Bitbucket pour optimiser les flux de travail de création, de test et de déploiement du micrologiciel.",
  "CONTRACT_FIRMWARE_ENGINEER": "Ingénieur Firmware Contrat",
  "CS_LANG": "tchèque",
  "DA_LANG": "danois",
  "DE_LANG": "Allemand",
  "EGG_HARBOR_NJ_USA": "Canton d'Egg Harbor, New Jersey, États-Unis",
  "EL_LANG": "grec",
  "EN_LANG": "Anglais",
  "ES_LANG": "Espagnol",
  "EXPERIENCE": "Expérience",
  "FI_LANG": "finlandais",
  "FIRMWARE_UI_DEVELOPMENT": "Développement de l'interface utilisateur du micrologiciel",
  "FORT_COLLINS_COLORADO": "Fort Collins, Colorado",
  "FR_LANG": "Français",
  "FRONTEND": "L'extrémité avant",
  "FRONTEND_DESCRIPTION": "Hautement compétent en développement front-end, en scripts Web et en ingénierie d'interface utilisateur, avec une expertise approfondie dans la gestion de monorepos d'interface utilisateur complexes et à grande échelle à l'aide des frameworks React, TypeScript, JavaScript et Lit. Dirigé la conception et la livraison de plusieurs applications d'entreprise actuellement en production dans des sociétés Fortune 500.",
  "HACH_EXPERIENCE_1": "Maintenez un monorepo TypeScript + Lit à grande échelle en utilisant MVC et l'architecture d'interface utilisateur atomique.",
  "HACH_EXPERIENCE_2": "Implémentez et gérez des sous-modules d'interface utilisateur pour plusieurs projets, prenant en charge les affichages d'analyse de l'eau.",
  "HACH_EXPERIENCE_3": "Implémentation de règles et de configurations ESLint personnalisées et développement de tests unitaires Jest pour les composants de l'interface utilisateur.",
  "HI_LANG": "hindi",
  "HOME": "Maison",
  "HU_LANG": "hongrois",
  "ID_LANG": "indonésien",
  "IT_LANG": "italien",
  "JA_LANG": "japonais",
  "JUNE_2021": "juin 2021",
  "KO_LANG": "coréen",
  "LOVELAND_CO_USA": "Loveland, Colorado, États-Unis",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pennsylvanie, États-Unis",
  "NL_LANG": "Néerlandais",
  "NO_LANG": "Norvégien",
  "PHLSCI_EXPERIENCE_1": "Concevoir, développer et tester des composants logiciels pour les systèmes Battery Manager.",
  "PHLSCI_EXPERIENCE_2": "Conception et développement d'applications Web et d'interfaces graphiques utilisées par les employés des centres de distribution pour des clients tels que Target, Uline et TJX.",
  "PHLSCI_EXPERIENCE_3": "Activités d'assistance quotidiennes, résolution des bogues du système, assistance aux questions des clients/site.",
  "PL_LANG": "polonais",
  "PRESENT": "Présent",
  "PROJECTS": "Projets",
  "PT_LANG": "portugais",
  "REGULUS_EXPERIENCE_1": "Interface utilisateur améliorée pour la saisie des demandes de données et la sortie des résultats analytiques.",
  "REGULUS_EXPERIENCE_2": "Amélioration de l’efficacité des bases de données et des délais d’exécution.",
  "REGULUS_EXPERIENCE_3": "Développement de pages Web de style tableau de bord affichant les performances globales du système en temps réel et historiques.",
  "RESUME": "CV",
  "RO_LANG": "roumain",
  "RU_LANG": "russe",
  "SEPTEMBER_2022": "septembre 2022",
  "SOFTWARE_DEVELOPMENT": "Développement de logiciels",
  "SOFTWARE_ENGINEER": "Ingénieur logiciel",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Tableau de bord Surveillance Spotlight",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Outil logiciel développé pour la Federal Aviation Administration (FAA). L'outil affiche les données de vol provenant de différentes sources de données. Les utilisateurs peuvent choisir entre des données quotidiennes et mensuelles, et les données sont renseignées dans un tableau de bord interactif.",
  "SV_LANG": "suédois",
  "TECH_STACK": "Pile technologique",
  "TH_LANG": "thaïlandais",
  "TR_LANG": "turc",
  "UK_LANG": "ukrainien",
  "VI_LANG": "vietnamien",
  "WATER_ANALYSIS_UI": "Interface utilisateur d'analyse de l'eau",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Implémentation de composants d'interface utilisateur évolutifs et modulaires à l'aide de l'interface utilisateur atomique et de l'architecture modulaire MVC pour prendre en charge l'analyse de l'eau et la visualisation des mesures en temps réel pour les ingénieurs internes, les techniciens de laboratoire et les clients.",
  "WORK_EXPERIENCE": "Expérience professionnelle",
  "ZH_LANG": "Chinois"
}