{
  "ABOUT": "Di",
  "ABOUT_HEADLINE": "Sono specializzato nello sviluppo web, creando prodotti scalabili e ad alte prestazioni con esperienze utente senza soluzione di continuità.",
  "ABOUT_ME": "Su di me",
  "ABOUT_SUPPORTING_TEXT": "Con oltre quattro anni di esperienza professionale, contribuisco alla realizzazione di soluzioni software affidabili ed efficienti. Il mio lavoro ha alimentato le applicazioni utilizzate dalle aziende Fortune 500, garantendo prestazioni, scalabilità e manutenibilità.",
  "APRIL_2025": "aprile 2025",
  "AR_LANG": "arabo",
  "BACKEND": "Backend",
  "BACKEND_DESCRIPTION": "Esperto nello sviluppo di API RESTful, nella scrittura e nell'ottimizzazione di query SQL complesse e nella gestione di database relazionali. Esperienza nella perfetta integrazione tra sistemi frontend e backend per applicazioni ad alte prestazioni.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Display delle operazioni del gestore batteria",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "App web programmata per visualizzare l'attività di manutenzione delle batterie dei centri di distribuzione. Funziona su dispositivi Raspberry Pi. Visualizza le attività di manutenzione delle batterie in tempo reale per i centri di distribuzione in grafici e tabelle interattive.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Sviluppo dello stack completo di un'app Web per i dispositivi utilizzati dai dipendenti dei centri di distribuzione per mantenere, monitorare e visualizzare le statistiche per le batterie industriali. Utilizzato da diverse aziende Fortune 500.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Gestione batteria Toccare l'app Web del computer",
  "BN_LANG": "bengalese",
  "CI_CD_DESCRIPTION": "Esperto nella semplificazione delle pipeline di distribuzione per soluzioni CI/CD scalabili ed efficienti. Sfruttare le azioni GitHub per distribuire e ospitare applicazioni React su Amazon S3, nonché implementare pipeline Jenkins automatizzate integrate con Bitbucket per ottimizzare i flussi di lavoro di creazione, test e distribuzione del firmware.",
  "CONTRACT_FIRMWARE_ENGINEER": "Ingegnere firmware a contratto",
  "CS_LANG": "ceco",
  "DA_LANG": "danese",
  "DE_LANG": "tedesco",
  "EGG_HARBOR_NJ_USA": "Egg Harbor Township, New Jersey, Stati Uniti",
  "EL_LANG": "greco",
  "EN_LANG": "Inglese",
  "ES_LANG": "spagnolo",
  "EXPERIENCE": "Esperienza",
  "FI_LANG": "finlandese",
  "FIRMWARE_UI_DEVELOPMENT": "Sviluppo dell'interfaccia utente del firmware",
  "FORT_COLLINS_COLORADO": "Fort Collins, Colorado",
  "FR_LANG": "francese",
  "FRONTEND": "Fine frontale",
  "FRONTEND_DESCRIPTION": "Altamente qualificato nello sviluppo frontend, nello scripting Web e nell'ingegneria dell'interfaccia utente con una profonda esperienza nella gestione di monorepos UI complessi e su larga scala utilizzando framework React, TypeScript, JavaScript e Lit. Ha guidato la progettazione e la fornitura di molteplici applicazioni di livello aziendale attualmente in produzione nelle aziende Fortune 500.",
  "HACH_EXPERIENCE_1": "Mantieni un monorepo TypeScript + Lit su larga scala utilizzando MVC e l'architettura dell'interfaccia utente atomica.",
  "HACH_EXPERIENCE_2": "Implementa e gestisci i sottomoduli dell'interfaccia utente per diversi progetti, supportando le visualizzazioni dell'analisi dell'acqua.",
  "HACH_EXPERIENCE_3": "Implementate regole e configurazioni ESLint personalizzate e sviluppati unit test Jest per i componenti dell'interfaccia utente.",
  "HI_LANG": "hindi",
  "HOME": "Casa",
  "HU_LANG": "ungherese",
  "ID_LANG": "indonesiano",
  "IT_LANG": "Italiano",
  "JA_LANG": "giapponese",
  "JUNE_2021": "Giugno 2021",
  "KO_LANG": "coreano",
  "LOVELAND_CO_USA": "Loveland, Colorado, Stati Uniti",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pennsylvania, Stati Uniti",
  "NL_LANG": "Olandese",
  "NO_LANG": "Norvegese",
  "PHLSCI_EXPERIENCE_1": "Progettare, sviluppare e testare componenti software per i sistemi Battery Manager.",
  "PHLSCI_EXPERIENCE_2": "Progettazione e sviluppo di applicazioni e GUI basate sul Web utilizzate dai dipendenti del centro di distribuzione per clienti come Target, Uline e TJX.",
  "PHLSCI_EXPERIENCE_3": "Attività di supporto quotidiane, risoluzione di bug di sistema, assistenza per domande sui clienti/sito.",
  "PL_LANG": "Polacco",
  "PRESENT": "Presente",
  "PROJECTS": "Progetti",
  "PT_LANG": "portoghese",
  "REGULUS_EXPERIENCE_1": "Interfaccia utente aggiornata sia per l'immissione di richieste di dati che per l'output di risultati analitici.",
  "REGULUS_EXPERIENCE_2": "Miglioramento dell'efficienza del database e dei tempi di consegna.",
  "REGULUS_EXPERIENCE_3": "Pagine Web sviluppate in stile dashboard che mostrano le prestazioni generali del sistema in tempo reale e storiche.",
  "RESUME": "Riprendere",
  "RO_LANG": "rumeno",
  "RU_LANG": "russo",
  "SEPTEMBER_2022": "Settembre 2022",
  "SOFTWARE_DEVELOPMENT": "Sviluppo software",
  "SOFTWARE_ENGINEER": "Ingegnere del software",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Dashboard Spotlight di sorveglianza",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Strumento software sviluppato per la Federal Aviation Administration (FAA). Lo strumento visualizza i dati di volo provenienti da diverse origini dati. Gli utenti possono scegliere tra dati giornalieri e mensili e i dati vengono inseriti in una dashboard interattiva.",
  "SV_LANG": "svedese",
  "TECH_STACK": "Pila tecnologica",
  "TH_LANG": "tailandese",
  "TR_LANG": "turco",
  "UK_LANG": "ucraino",
  "VI_LANG": "vietnamita",
  "WATER_ANALYSIS_UI": "Interfaccia utente per l'analisi dell'acqua",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Implementazione di componenti dell'interfaccia utente scalabili e modulari utilizzando l'interfaccia utente atomica e l'architettura modulare MVC per supportare l'analisi dell'acqua in tempo reale e la visualizzazione delle misurazioni per ingegneri interni, tecnici di laboratorio e clienti.",
  "WORK_EXPERIENCE": "Esperienza di lavoro",
  "ZH_LANG": "cinese"
}