{
  "ABOUT": "O",
  "ABOUT_HEADLINE": "Specjalizuję się w tworzeniu stron internetowych, budowaniu skalowalnych i wydajnych produktów zapewniających płynne doświadczenia użytkownika.",
  "ABOUT_ME": "O mnie",
  "ABOUT_SUPPORTING_TEXT": "Dzięki ponad czteroletniemu doświadczeniu zawodowemu przyczyniam się do budowania niezawodnych i wydajnych rozwiązań programowych. Moja praca zasilała aplikacje używane przez firmy z listy Fortune 500, zapewniając wydajność, skalowalność i łatwość konserwacji.",
  "APRIL_2025": "kwiecień 2025",
  "AR_LANG": "arabski",
  "BACKEND": "Backend",
  "BACKEND_DESCRIPTION": "Umiejętność programowania RESTful API, pisania i optymalizacji złożonych zapytań SQL oraz zarządzania relacyjnymi bazami danych. Doświadczony w płynnej integracji systemów frontendowych i backendowych dla aplikacji o wysokiej wydajności.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Wyświetlacz operacji menedżera baterii",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Zaprogramowana aplikacja internetowa wyświetlająca czynności związane z konserwacją akumulatorów w centrach dystrybucyjnych. Działa na urządzeniach Raspberry Pi. Wyświetla w czasie rzeczywistym działania związane z konserwacją akumulatorów w centrach dystrybucyjnych na interaktywnych wykresach i tabelach.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Pełny rozwój aplikacji internetowej dla urządzeń używanych przez pracowników centrów dystrybucyjnych do konserwacji, śledzenia i przeglądania statystyk dotyczących akumulatorów przemysłowych. Używany przez kilka firm z listy Fortune 500.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Aplikacja internetowa na komputer dotykowy Menedżer baterii",
  "BN_LANG": "bengalski",
  "CI_CD_DESCRIPTION": "Umiejętność usprawniania potoków wdrażania skalowalnych i wydajnych rozwiązań CI/CD. Wykorzystywanie akcji GitHub do wdrażania i hostowania aplikacji React na Amazon S3, a także wdrażanie zautomatyzowanych potoków Jenkins zintegrowanych z Bitbucket w celu optymalizacji procesów tworzenia, testowania i wdrażania oprogramowania sprzętowego.",
  "CONTRACT_FIRMWARE_ENGINEER": "Inżynier oprogramowania sprzętowego kontraktu",
  "CS_LANG": "czeski",
  "DA_LANG": "duński",
  "DE_LANG": "niemiecki",
  "EGG_HARBOR_NJ_USA": "Miasteczko Egg Harbor w stanie New Jersey, USA",
  "EL_LANG": "grecki",
  "EN_LANG": "angielski",
  "ES_LANG": "hiszpański",
  "EXPERIENCE": "Doświadczenie",
  "FI_LANG": "fiński",
  "FIRMWARE_UI_DEVELOPMENT": "Rozwój interfejsu oprogramowania sprzętowego",
  "FORT_COLLINS_COLORADO": "Fort Collins w Kolorado",
  "FR_LANG": "francuski",
  "FRONTEND": "Frontend",
  "FRONTEND_DESCRIPTION": "Wysoko wykwalifikowany w tworzeniu frontendu, pisaniu skryptów internetowych i inżynierii interfejsu użytkownika z głęboką wiedzą w zarządzaniu złożonymi monorepo interfejsu użytkownika na dużą skalę przy użyciu frameworków React, TypeScript, JavaScript i Lit. Kierował projektowaniem i dostarczaniem wielu aplikacji klasy korporacyjnej, które są obecnie produkowane w firmach z listy Fortune 500.",
  "HACH_EXPERIENCE_1": "Utrzymuj wielkoskalowe monorepo TypeScript + Lit z wykorzystaniem architektury MVC i atomowego interfejsu użytkownika.",
  "HACH_EXPERIENCE_2": "Wdrażaj i zarządzaj podmodułami interfejsu użytkownika dla kilku projektów, obsługującymi wyświetlacze analizy wody.",
  "HACH_EXPERIENCE_3": "Zaimplementowano niestandardowe reguły i konfiguracje ESLint oraz opracowano testy jednostkowe Jest dla komponentów interfejsu użytkownika.",
  "HI_LANG": "hinduski",
  "HOME": "Dom",
  "HU_LANG": "węgierski",
  "ID_LANG": "indonezyjski",
  "IT_LANG": "włoski",
  "JA_LANG": "japoński",
  "JUNE_2021": "Czerwiec 2021",
  "KO_LANG": "koreański",
  "LOVELAND_CO_USA": "Loveland, Kolorado, USA",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pensylwania, USA",
  "NL_LANG": "Holenderski",
  "NO_LANG": "Norweg",
  "PHLSCI_EXPERIENCE_1": "Projektuj, rozwijaj i testuj komponenty oprogramowania dla systemów Battery Manager.",
  "PHLSCI_EXPERIENCE_2": "Projektowanie i rozwój aplikacji internetowych i GUI używanych przez pracowników centrów dystrybucyjnych dla klientów takich jak Target, Uline i TJX.",
  "PHLSCI_EXPERIENCE_3": "Codzienne działania wsparcia, rozwiązywanie błędów systemowych, pomoc w przypadku pytań klientów/obiektu.",
  "PL_LANG": "Polski",
  "PRESENT": "Obecny",
  "PROJECTS": "Projektowanie",
  "PT_LANG": "portugalski",
  "REGULUS_EXPERIENCE_1": "Ulepszony interfejs użytkownika zarówno do wprowadzania żądań danych, jak i wysyłania wyników analitycznych.",
  "REGULUS_EXPERIENCE_2": "Poprawiona wydajność bazy danych i skrócenie czasu realizacji.",
  "REGULUS_EXPERIENCE_3": "Opracowano strony internetowe w stylu pulpitu nawigacyjnego, pokazujące ogólną wydajność systemu w czasie rzeczywistym i historyczną.",
  "RESUME": "Wznawiać",
  "RO_LANG": "rumuński",
  "RU_LANG": "rosyjski",
  "SEPTEMBER_2022": "wrzesień 2022 r",
  "SOFTWARE_DEVELOPMENT": "Rozwój oprogramowania",
  "SOFTWARE_ENGINEER": "Inżynier oprogramowania",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Pulpit nawigacyjny reflektorów nadzoru",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Narzędzie programowe opracowane dla Federalnej Administracji Lotniczej (FAA). Narzędzie wyświetla dane lotu z różnych źródeł danych. Użytkownicy mogą wybierać pomiędzy danymi dziennymi i miesięcznymi, a dane są wprowadzane do interaktywnego pulpitu nawigacyjnego.",
  "SV_LANG": "szwedzki",
  "TECH_STACK": "Stos Technologiczny",
  "TH_LANG": "tajski",
  "TR_LANG": "turecki",
  "UK_LANG": "ukraiński",
  "VI_LANG": "wietnamski",
  "WATER_ANALYSIS_UI": "Interfejs analizy wody",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Wdrożono skalowalne, modułowe komponenty interfejsu użytkownika wykorzystujące architekturę Atomic UI i Modular MVC w celu obsługi analizy wody w czasie rzeczywistym i wizualizacji pomiarów dla inżynierów wewnętrznych, techników laboratoryjnych i klientów.",
  "WORK_EXPERIENCE": "Doświadczenie zawodowe",
  "ZH_LANG": "chiński"
}