{
  "ABOUT": "Um",
  "ABOUT_HEADLINE": "Ich bin auf Webentwicklung spezialisiert und skalierbare und leistungsstarke Produkte mit nahtlosen Benutzererlebnissen.",
  "ABOUT_ME": "Über mich",
  "ABOUT_SUPPORTING_TEXT": "Mit über vier Jahren Berufserfahrung trage ich zum Aufbau zuverlässiger und effizienter Softwarelösungen bei. Meine Arbeit hat Anwendungen unterstützt, die von Fortune-500-Unternehmen verwendet werden, und dabei Leistung, Skalierbarkeit und Wartbarkeit sichergestellt.",
  "APRIL_2025": "April 2025",
  "AR_LANG": "Arabisch",
  "BACKEND": "Backend",
  "BACKEND_DESCRIPTION": "Kenntnisse in der RESTful-API-Entwicklung, dem Schreiben und Optimieren komplexer SQL-Abfragen sowie der Verwaltung relationaler Datenbanken. Erfahrung in der nahtlosen Integration zwischen Frontend- und Backend-Systemen für Hochleistungsanwendungen.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Betriebsanzeige des Batteriemanagers",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Programmierte Web-App zur Anzeige der Batteriewartungsaktivitäten der Vertriebszentren. Läuft auf Raspberry Pi-Geräten. Zeigt Batteriewartungsaktivitäten für Vertriebszentren in Echtzeit in interaktiven Grafiken und Tabellen an.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Full-Stack-Entwicklung einer Web-App für Geräte, die von Mitarbeitern des Vertriebszentrums zum Verwalten, Verfolgen und Anzeigen von Statistiken für Industriebatterien verwendet werden. Wird von mehreren Fortune-500-Unternehmen verwendet.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Battery Manager Touch Computer-Web-App",
  "BN_LANG": "Bengali",
  "CI_CD_DESCRIPTION": "Erfahren in der Rationalisierung von Bereitstellungspipelines für skalierbare und effiziente CI/CD-Lösungen. Nutzung von GitHub Actions zum Bereitstellen und Hosten von React-Anwendungen auf Amazon S3 sowie Implementierung automatisierter Jenkins-Pipelines, die in Bitbucket integriert sind, um Workflows für Firmware-Erstellung, -Tests und -Bereitstellung zu optimieren.",
  "CONTRACT_FIRMWARE_ENGINEER": "Vertrags-Firmware-Ingenieur",
  "CS_LANG": "tschechisch",
  "DA_LANG": "dänisch",
  "DE_LANG": "Deutsch",
  "EGG_HARBOR_NJ_USA": "Egg Harbor Township, New Jersey, USA",
  "EL_LANG": "griechisch",
  "EN_LANG": "Englisch",
  "ES_LANG": "Spanisch",
  "EXPERIENCE": "Erfahrung",
  "FI_LANG": "finnisch",
  "FIRMWARE_UI_DEVELOPMENT": "Firmware-UI-Entwicklung",
  "FORT_COLLINS_COLORADO": "Fort Collins, Colorado",
  "FR_LANG": "Französisch",
  "FRONTEND": "Frontend",
  "FRONTEND_DESCRIPTION": "Hochqualifiziert in Frontend-Entwicklung, Web-Scripting und UI-Engineering mit umfassender Erfahrung in der Verwaltung komplexer, umfangreicher UI-Monorepos mit React-, TypeScript-, JavaScript- und Lit-Frameworks. Leitete das Design und die Bereitstellung mehrerer Unternehmensanwendungen, die derzeit bei Fortune-500-Unternehmen in Produktion sind.",
  "HACH_EXPERIENCE_1": "Pflegen Sie ein umfangreiches TypeScript + Lit-Monorepo unter Verwendung von MVC und einer atomaren UI-Architektur.",
  "HACH_EXPERIENCE_2": "Implementieren und verwalten Sie UI-Submodule für mehrere Projekte und unterstützen Sie die Anzeige von Wasseranalysen.",
  "HACH_EXPERIENCE_3": "Implementierte benutzerdefinierte ESLint-Regeln und -Konfigurationen und entwickelte Jest-Komponententests für UI-Komponenten.",
  "HI_LANG": "Hindi",
  "HOME": "Heim",
  "HU_LANG": "ungarisch",
  "ID_LANG": "Indonesisch",
  "IT_LANG": "Italienisch",
  "JA_LANG": "japanisch",
  "JUNE_2021": "Juni 2021",
  "KO_LANG": "Koreanisch",
  "LOVELAND_CO_USA": "Loveland, Colorado, USA",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pennsylvania, USA",
  "NL_LANG": "Niederländisch",
  "NO_LANG": "Norwegen",
  "PHLSCI_EXPERIENCE_1": "Entwerfen, entwickeln und testen Sie Softwarekomponenten für Battery Manager-Systeme.",
  "PHLSCI_EXPERIENCE_2": "Entwerfen und Entwickeln webbasierter Anwendungen und GUIs, die von Mitarbeitern des Vertriebszentrums für Kunden wie Target, Uline und TJX verwendet werden.",
  "PHLSCI_EXPERIENCE_3": "Tägliche Supportaktivitäten, Behebung von Systemfehlern, Unterstützung bei Kunden-/Standortfragen.",
  "PL_LANG": "Polieren",
  "PRESENT": "Gegenwärtig",
  "PROJECTS": "Projekte",
  "PT_LANG": "Portugiesisch",
  "REGULUS_EXPERIENCE_1": "Verbesserte Benutzeroberfläche sowohl für die Eingabe von Datenanfragen als auch für die Ausgabe von Analyseergebnissen.",
  "REGULUS_EXPERIENCE_2": "Verbesserte Datenbankeffizienz und Bearbeitungszeiten.",
  "REGULUS_EXPERIENCE_3": "Entwickelte Webseiten im Dashboard-Stil, die die Gesamtleistung des Systems in Echtzeit und im Verlauf anzeigen.",
  "RESUME": "Wieder aufnehmen",
  "RO_LANG": "rumänisch",
  "RU_LANG": "Russisch",
  "SEPTEMBER_2022": "September 2022",
  "SOFTWARE_DEVELOPMENT": "Softwareentwicklung",
  "SOFTWARE_ENGINEER": "Software-Ingenieur",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Überwachungs-Spotlight-Dashboard",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Für die Federal Aviation Administration (FAA) entwickeltes Softwaretool. Das Tool zeigt Flugdaten aus verschiedenen Datenquellen an. Benutzer können zwischen täglichen und monatlichen Daten wählen und die Daten werden in ein interaktives Dashboard eingetragen.",
  "SV_LANG": "Schwedisch",
  "TECH_STACK": "Tech-Stack",
  "TH_LANG": "Thailändisch",
  "TR_LANG": "Türkisch",
  "UK_LANG": "Ukrainisch",
  "VI_LANG": "Vietnamesisch",
  "WATER_ANALYSIS_UI": "Benutzeroberfläche für die Wasseranalyse",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Implementierung skalierbarer, modularer UI-Komponenten mithilfe der Atomic UI und der modularen MVC-Architektur zur Unterstützung der Wasseranalyse und Messvisualisierung in Echtzeit für interne Ingenieure, Labortechniker und Kunden.",
  "WORK_EXPERIENCE": "Berufserfahrung",
  "ZH_LANG": "chinesisch"
}