{
  "ABOUT": "เกี่ยวกับ",
  "ABOUT_HEADLINE": "ฉันเชี่ยวชาญด้านการพัฒนาเว็บไซต์ การสร้างผลิตภัณฑ์ที่ปรับขนาดได้และมีประสิทธิภาพสูงพร้อมประสบการณ์ผู้ใช้ที่ราบรื่น",
  "ABOUT_ME": "เกี่ยวกับฉัน",
  "ABOUT_SUPPORTING_TEXT": "ด้วยประสบการณ์วิชาชีพกว่าสี่ปี ฉันมีส่วนร่วมในการสร้างโซลูชันซอฟต์แวร์ที่เชื่อถือได้และมีประสิทธิภาพ งานของฉันขับเคลื่อนแอปพลิเคชันที่ใช้โดยบริษัทที่ติดอันดับ Fortune 500 ซึ่งรับประกันประสิทธิภาพ ความสามารถในการปรับขนาด และการบำรุงรักษา",
  "APRIL_2025": "เมษายน 2025",
  "AR_LANG": "ภาษาอาหรับ",
  "BACKEND": "แบ็กเอนด์",
  "BACKEND_DESCRIPTION": "มีทักษะในการพัฒนา RESTful API การเขียนและเพิ่มประสิทธิภาพการสืบค้น SQL ที่ซับซ้อน และการจัดการฐานข้อมูลเชิงสัมพันธ์ มีประสบการณ์ในการบูรณาการอย่างราบรื่นระหว่างระบบส่วนหน้าและส่วนหลังสำหรับแอปพลิเคชันที่มีประสิทธิภาพสูง",
  "BATTERY_MANAGER_OPS_DISPLAY": "จอแสดงผลการทำงานของตัวจัดการแบตเตอรี่",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "โปรแกรมเว็บแอปเพื่อแสดงกิจกรรมการบำรุงรักษาแบตเตอรี่ของศูนย์กระจายสินค้า ทำงานบนอุปกรณ์ Raspberry Pi แสดงกิจกรรมการบำรุงรักษาแบตเตอรี่แบบเรียลไทม์สำหรับศูนย์กระจายสินค้าในรูปแบบกราฟและตารางเชิงโต้ตอบ",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "การพัฒนาเว็บแอปแบบเต็มรูปแบบสำหรับอุปกรณ์ที่พนักงานศูนย์กระจายสินค้าใช้เพื่อรักษา ติดตาม และดูสถิติสำหรับแบตเตอรี่อุตสาหกรรม มีการใช้งานโดยบริษัท Fortune 500 หลายแห่ง",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "ตัวจัดการแบตเตอรี่ Touch Computer Web App",
  "BN_LANG": "เบงกาลี",
  "CI_CD_DESCRIPTION": "มีทักษะในการปรับปรุงขั้นตอนการปรับใช้สำหรับโซลูชัน CI/CD ที่ปรับขนาดได้และมีประสิทธิภาพ การใช้ประโยชน์จาก GitHub Actions เพื่อปรับใช้และโฮสต์แอปพลิเคชัน React บน Amazon S3 รวมถึงการนำไปป์ไลน์ Jenkins อัตโนมัติที่ผสานรวมเข้ากับ Bitbucket เพื่อเพิ่มประสิทธิภาพการสร้าง การทดสอบ และเวิร์กโฟลว์การปรับใช้เฟิร์มแวร์",
  "CONTRACT_FIRMWARE_ENGINEER": "วิศวกรเฟิร์มแวร์สัญญา",
  "CS_LANG": "เช็ก",
  "DA_LANG": "ภาษาเดนมาร์ก",
  "DE_LANG": "เยอรมัน",
  "EGG_HARBOR_NJ_USA": "เมือง Egg Harbor รัฐนิวเจอร์ซีย์ สหรัฐอเมริกา",
  "EL_LANG": "กรีก",
  "EN_LANG": "ภาษาอังกฤษ",
  "ES_LANG": "สเปน",
  "EXPERIENCE": "ประสบการณ์",
  "FI_LANG": "ภาษาฟินแลนด์",
  "FIRMWARE_UI_DEVELOPMENT": "การพัฒนา UI เฟิร์มแวร์",
  "FORT_COLLINS_COLORADO": "ฟอร์ตคอลลินส์ โคโลราโด",
  "FR_LANG": "ภาษาฝรั่งเศส",
  "FRONTEND": "ส่วนหน้า",
  "FRONTEND_DESCRIPTION": "มีทักษะสูงในการพัฒนาส่วนหน้า การเขียนสคริปต์เว็บ และวิศวกรรม UI ที่มีความเชี่ยวชาญเชิงลึกในการจัดการ monorepos UI ขนาดใหญ่ที่ซับซ้อนโดยใช้ React, TypeScript, JavaScript และ Lit framework เป็นผู้นำการออกแบบและส่งมอบแอปพลิเคชันระดับองค์กรหลายรายการที่กำลังดำเนินการผลิตในบริษัทที่ติดอันดับ Fortune 500",
  "HACH_EXPERIENCE_1": "รักษา TypeScript + Lit monorepo ขนาดใหญ่โดยใช้สถาปัตยกรรม MVC และ atomic UI",
  "HACH_EXPERIENCE_2": "ใช้งานและจัดการโมดูลย่อย UI สำหรับหลายโครงการ ซึ่งสนับสนุนการแสดงการวิเคราะห์น้ำ",
  "HACH_EXPERIENCE_3": "ใช้กฎและการกำหนดค่า ESLint แบบกำหนดเอง และพัฒนาการทดสอบหน่วย Jest สำหรับส่วนประกอบ UI",
  "HI_LANG": "ฮินดี",
  "HOME": "บ้าน",
  "HU_LANG": "ภาษาฮังการี",
  "ID_LANG": "ชาวอินโดนีเซีย",
  "IT_LANG": "ภาษาอิตาลี",
  "JA_LANG": "ญี่ปุ่น",
  "JUNE_2021": "มิถุนายน 2021",
  "KO_LANG": "เกาหลี",
  "LOVELAND_CO_USA": "เลิฟแลนด์ โคโลราโด สหรัฐอเมริกา",
  "MONTGOMERYVILLE_PA_USA": "มอนต์กอเมอรีวิลล์ เพนซิลเวเนีย สหรัฐอเมริกา",
  "NL_LANG": "ภาษาดัตช์",
  "NO_LANG": "นอร์เวย์",
  "PHLSCI_EXPERIENCE_1": "ออกแบบ พัฒนา และทดสอบส่วนประกอบซอฟต์แวร์สำหรับระบบ Battery Manager",
  "PHLSCI_EXPERIENCE_2": "การออกแบบและพัฒนาแอปพลิเคชันบนเว็บและ GUI ที่พนักงานศูนย์กระจายสินค้าใช้สำหรับลูกค้าเช่น Target, Uline และ TJX",
  "PHLSCI_EXPERIENCE_3": "กิจกรรมสนับสนุนในแต่ละวัน แก้ไขจุดบกพร่องของระบบ ช่วยเหลือในการตอบคำถามของลูกค้า/ไซต์",
  "PL_LANG": "ขัด",
  "PRESENT": "ปัจจุบัน",
  "PROJECTS": "โครงการ",
  "PT_LANG": "โปรตุเกส",
  "REGULUS_EXPERIENCE_1": "อินเทอร์เฟซผู้ใช้ที่ได้รับการอัพเกรดสำหรับทั้งการร้องขอข้อมูลและผลลัพธ์การวิเคราะห์",
  "REGULUS_EXPERIENCE_2": "ปรับปรุงประสิทธิภาพของฐานข้อมูลและเวลาตอบสนอง",
  "REGULUS_EXPERIENCE_3": "หน้าเว็บสไตล์แดชบอร์ดที่พัฒนาขึ้นซึ่งแสดงประสิทธิภาพของระบบแบบเรียลไทม์และประวัติโดยรวม",
  "RESUME": "ประวัติย่อ",
  "RO_LANG": "โรมาเนีย",
  "RU_LANG": "ภาษารัสเซีย",
  "SEPTEMBER_2022": "กันยายน 2022",
  "SOFTWARE_DEVELOPMENT": "การพัฒนาซอฟต์แวร์",
  "SOFTWARE_ENGINEER": "วิศวกรซอฟต์แวร์",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "แดชบอร์ดสปอตไลต์การเฝ้าระวัง",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "เครื่องมือซอฟต์แวร์ที่พัฒนาขึ้นสำหรับ Federal Aviation Administration (FAA) เครื่องมือนี้แสดงข้อมูลเที่ยวบินจากแหล่งข้อมูลต่างๆ ผู้ใช้สามารถเลือกระหว่างข้อมูลรายวันหรือรายเดือน และข้อมูลจะถูกเติมลงในแดชบอร์ดแบบโต้ตอบ",
  "SV_LANG": "ภาษาสวีเดน",
  "TECH_STACK": "เทคสแต็ค",
  "TH_LANG": "แบบไทย",
  "TR_LANG": "ภาษาตุรกี",
  "UK_LANG": "ภาษายูเครน",
  "VI_LANG": "ภาษาเวียดนาม",
  "WATER_ANALYSIS_UI": "UI การวิเคราะห์น้ำ",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "ใช้ส่วนประกอบ UI แบบโมดูลาร์ที่ปรับขนาดได้โดยใช้ Atomic UI และสถาปัตยกรรม Modular MVC เพื่อรองรับการวิเคราะห์น้ำแบบเรียลไทม์และการแสดงภาพการวัดสำหรับวิศวกรภายใน ช่างเทคนิคในห้องปฏิบัติการ และลูกค้า",
  "WORK_EXPERIENCE": "ประสบการณ์การทำงาน",
  "ZH_LANG": "ชาวจีน"
}