{
  "ABOUT": "Despre",
  "ABOUT_HEADLINE": "Sunt specializat în dezvoltare web, construind produse scalabile și de înaltă performanță, cu experiențe de utilizator fără întreruperi.",
  "ABOUT_ME": "Despre mine",
  "ABOUT_SUPPORTING_TEXT": "Cu peste patru ani de experiență profesională, contribui la construirea de soluții software fiabile și eficiente. Munca mea a alimentat aplicațiile utilizate de companiile Fortune 500, asigurând performanță, scalabilitate și mentenanță.",
  "APRIL_2025": "aprilie 2025",
  "AR_LANG": "arabic",
  "BACKEND": "Backend",
  "BACKEND_DESCRIPTION": "Cunoștințe în dezvoltarea API-ului RESTful, scrierea și optimizarea interogărilor SQL complexe și gestionarea bazelor de date relaționale. Cu experiență în integrarea perfectă între sistemele frontend și backend pentru aplicații de înaltă performanță.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Afișaj Operațiuni Manager baterie",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Aplicație web programată pentru a afișa activitatea de întreținere a bateriilor din centrele de distribuție. Funcționează pe dispozitivele Raspberry Pi. Afișează activitățile de întreținere a bateriei în timp real pentru centrele de distribuție în grafice și tabele interactive.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Dezvoltare completă a aplicației web pentru dispozitivele utilizate de angajații centrului de distribuție pentru a întreține, urmări și vizualiza statistici pentru bateriile industriale. Utilizat de mai multe companii Fortune 500.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Aplicația Web pentru computer Touch Manager Baterie",
  "BN_LANG": "bengaleză",
  "CI_CD_DESCRIPTION": "Cu competențe în eficientizarea conductelor de implementare pentru soluții CI/CD scalabile și eficiente. Folosirea GitHub Actions pentru implementarea și găzduirea aplicațiilor React pe Amazon S3, precum și implementarea conductelor Jenkins automatizate integrate cu Bitbucket pentru a optimiza fluxurile de lucru pentru construirea, testarea și implementarea firmware-ului.",
  "CONTRACT_FIRMWARE_ENGINEER": "Contract Firmware Engineer",
  "CS_LANG": "ceh",
  "DA_LANG": "danez",
  "DE_LANG": "german",
  "EGG_HARBOR_NJ_USA": "Egg Harbor Township, New Jersey, SUA",
  "EL_LANG": "greacă",
  "EN_LANG": "engleză",
  "ES_LANG": "spaniolă",
  "EXPERIENCE": "Experienţă",
  "FI_LANG": "finlandeză",
  "FIRMWARE_UI_DEVELOPMENT": "Dezvoltare Firmware UI",
  "FORT_COLLINS_COLORADO": "Fort Collins, Colorado",
  "FR_LANG": "franceză",
  "FRONTEND": "În față",
  "FRONTEND_DESCRIPTION": "Cu înaltă calificare în dezvoltarea front-end, scripting web și inginerie UI, cu o experiență profundă în gestionarea monorepo-urilor UI complexe, la scară largă, folosind cadre React, TypeScript, JavaScript și Lit. A condus proiectarea și livrarea mai multor aplicații de nivel enterprise aflate în prezent în producție în companiile Fortune 500.",
  "HACH_EXPERIENCE_1": "Mențineți un monorepo TypeScript + Lit la scară largă utilizând arhitectura MVC și atomic UI.",
  "HACH_EXPERIENCE_2": "Implementați și gestionați submodulele UI pentru mai multe proiecte, susținând afișaje de analiză a apei.",
  "HACH_EXPERIENCE_3": "Am implementat reguli și configurații personalizate ESLint și am dezvoltat teste unitare Jest pentru componentele UI.",
  "HI_LANG": "hindi",
  "HOME": "Acasă",
  "HU_LANG": "maghiară",
  "ID_LANG": "indoneziană",
  "IT_LANG": "italian",
  "JA_LANG": "japonez",
  "JUNE_2021": "iunie 2021",
  "KO_LANG": "coreean",
  "LOVELAND_CO_USA": "Loveland, Colorado, SUA",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pennsylvania, SUA",
  "NL_LANG": "olandeză",
  "NO_LANG": "norvegiană",
  "PHLSCI_EXPERIENCE_1": "Proiectați, dezvoltați și testați componente software pentru sistemele Battery Manager.",
  "PHLSCI_EXPERIENCE_2": "Proiectarea și dezvoltarea de aplicații bazate pe web și GUI utilizate de angajații centrului de distribuție pentru clienți precum Target, Uline și TJX.",
  "PHLSCI_EXPERIENCE_3": "Activități de asistență zilnică, rezolvarea erorilor de sistem, asistență cu întrebările clienților/site-ului.",
  "PL_LANG": "Lustrui",
  "PRESENT": "Prezent",
  "PROJECTS": "Proiecte",
  "PT_LANG": "portugheză",
  "REGULUS_EXPERIENCE_1": "Interfață de utilizator îmbunătățită atât pentru introducerea cererilor de date, cât și pentru obținerea rezultatelor analitice.",
  "REGULUS_EXPERIENCE_2": "Eficiență îmbunătățită a bazei de date și timpi de livrare.",
  "REGULUS_EXPERIENCE_3": "Pagini web dezvoltate în stil tablou de bord care arată performanța generală a sistemului în timp real și istorică.",
  "RESUME": "Relua",
  "RO_LANG": "română",
  "RU_LANG": "rusă",
  "SEPTEMBER_2022": "septembrie 2022",
  "SOFTWARE_DEVELOPMENT": "Dezvoltare software",
  "SOFTWARE_ENGINEER": "Inginer software",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Tabloul de bord Surveillance Spotlight",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Instrument software dezvoltat pentru Administrația Federală a Aviației (FAA). Instrumentul afișează date de zbor din diferite surse de date. Utilizatorii pot alege între date zilnice și lunare, iar datele sunt populate într-un tablou de bord interactiv.",
  "SV_LANG": "suedez",
  "TECH_STACK": "Stiva tehnologică",
  "TH_LANG": "thailandez",
  "TR_LANG": "turc",
  "UK_LANG": "ucraineană",
  "VI_LANG": "vietnamez",
  "WATER_ANALYSIS_UI": "Interfața de utilizare pentru analiza apei",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Implementarea componentelor UI modulare, scalabile, folosind arhitectura Atomic UI și Modular MVC pentru a sprijini analiza în timp real a apei și vizualizarea măsurătorilor pentru inginerii interni, tehnicienii de laborator și clienții.",
  "WORK_EXPERIENCE": "Experiență de muncă",
  "ZH_LANG": "chinez"
}