{
  "ABOUT": "про",
  "ABOUT_HEADLINE": "Я спеціалізуюся на веб-розробці, створюю масштабовані та високопродуктивні продукти з бездоганною взаємодією з користувачем.",
  "ABOUT_ME": "Про мене",
  "ABOUT_SUPPORTING_TEXT": "Маючи понад чотири роки професійного досвіду, я роблю внесок у створення надійних та ефективних програмних рішень. У моїй роботі працюють програми, що використовуються компаніями зі списку Fortune 500, забезпечуючи продуктивність, масштабованість і зручність обслуговування.",
  "APRIL_2025": "Квітень 2025",
  "AR_LANG": "арабська",
  "BACKEND": "Бекенд",
  "BACKEND_DESCRIPTION": "Кваліфікований у розробці RESTful API, написанні й оптимізації складних SQL-запитів, а також управлінні реляційними базами даних. Досвід бездоганної інтеграції між зовнішніми та серверними системами для високопродуктивних програм.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Дисплей керування батареєю",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Запрограмований веб-додаток для відображення діяльності з обслуговування акумулятора розподільних центрів. Працює на пристроях Raspberry Pi. Відображає в режимі реального часу дії з технічного обслуговування батареї для розподільних центрів в інтерактивних графіках і таблицях.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Розробка повного стека веб-додатків для пристроїв, які використовуються працівниками розподільного центру для обслуговування, відстеження та перегляду статистики для промислових акумуляторів. Використовується кількома компаніями зі списку Fortune 500.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Battery Manager Touch Computer Web App",
  "BN_LANG": "Бенгальська",
  "CI_CD_DESCRIPTION": "Маю навички оптимізації конвеєрів розгортання для масштабованих і ефективних рішень CI/CD. Використання GitHub Actions для розгортання та розміщення додатків React на Amazon S3, а також впровадження автоматизованих конвеєрів Jenkins, інтегрованих із Bitbucket, для оптимізації робочих процесів збірки, тестування та розгортання вбудованого програмного забезпечення.",
  "CONTRACT_FIRMWARE_ENGINEER": "Інженер з програмного забезпечення за контрактом",
  "CS_LANG": "чеська",
  "DA_LANG": "датська",
  "DE_LANG": "Німецький",
  "EGG_HARBOR_NJ_USA": "Егг-Харбор Тауншип, Нью-Джерсі, США",
  "EL_LANG": "грецька",
  "EN_LANG": "англійська",
  "ES_LANG": "Іспанська",
  "EXPERIENCE": "Досвід",
  "FI_LANG": "фінська",
  "FIRMWARE_UI_DEVELOPMENT": "Розробка інтерфейсу програмного забезпечення",
  "FORT_COLLINS_COLORADO": "Форт Коллінз, Колорадо",
  "FR_LANG": "французька",
  "FRONTEND": "Інтерфейс",
  "FRONTEND_DESCRIPTION": "Високий досвід у розробці зовнішнього інтерфейсу, веб-скриптів та розробки інтерфейсу користувача з глибоким досвідом керування складними, великомасштабними монорепозиторіями інтерфейсу користувача за допомогою фреймворків React, TypeScript, JavaScript і Lit. Керував розробкою та доставкою багатьох додатків корпоративного рівня, які зараз розробляються в компаніях зі списку Fortune 500.",
  "HACH_EXPERIENCE_1": "Підтримуйте великомасштабне монорепо TypeScript + Lit, використовуючи MVC і атомарну архітектуру інтерфейсу користувача.",
  "HACH_EXPERIENCE_2": "Впроваджуйте та керуйте підмодулями інтерфейсу користувача для кількох проектів, підтримуючи дисплеї аналізу води.",
  "HACH_EXPERIENCE_3": "Реалізовано спеціальні правила та конфігурації ESLint, а також розроблено модульні тести Jest для компонентів інтерфейсу користувача.",
  "HI_LANG": "Хінді",
  "HOME": "додому",
  "HU_LANG": "угорська",
  "ID_LANG": "індонезійська",
  "IT_LANG": "італійська",
  "JA_LANG": "Японський",
  "JUNE_2021": "Червень 2021",
  "KO_LANG": "корейська",
  "LOVELAND_CO_USA": "Лавленд, Колорадо, США",
  "MONTGOMERYVILLE_PA_USA": "Монтгомерівілль, штат Пенсільванія, США",
  "NL_LANG": "голландська",
  "NO_LANG": "норвезький",
  "PHLSCI_EXPERIENCE_1": "Проектування, розробка та тестування компонентів програмного забезпечення для систем Battery Manager.",
  "PHLSCI_EXPERIENCE_2": "Проектування та розробка веб-додатків і графічних інтерфейсів, які використовуються працівниками розподільних центрів для таких клієнтів, як Target, Uline і TJX.",
  "PHLSCI_EXPERIENCE_3": "Щоденна підтримка, вирішення системних помилок, допомога з питаннями клієнтів/сайту.",
  "PL_LANG": "польський",
  "PRESENT": "присутній",
  "PROJECTS": "Проекти",
  "PT_LANG": "португальська",
  "REGULUS_EXPERIENCE_1": "Оновлений інтерфейс користувача як для введення запитів на дані, так і для виведення аналітичних результатів.",
  "REGULUS_EXPERIENCE_2": "Покращена ефективність бази даних і час виконання.",
  "REGULUS_EXPERIENCE_3": "Розроблені веб-сторінки в стилі інформаційної панелі, що показують загальну продуктивність системи в реальному часі та за попередні періоди.",
  "RESUME": "Резюме",
  "RO_LANG": "румунська",
  "RU_LANG": "російська",
  "SEPTEMBER_2022": "вересень 2022 р",
  "SOFTWARE_DEVELOPMENT": "Розробка програмного забезпечення",
  "SOFTWARE_ENGINEER": "Інженер-програміст",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Інформаційна панель спостереження Spotlight",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Програмне забезпечення, розроблене для Федерального управління цивільної авіації (FAA). Інструмент відображає дані польоту з різних джерел даних. Користувачі можуть вибирати між щоденними та місячними даними, і дані заповнюються на інтерактивній інформаційній панелі.",
  "SV_LANG": "шведська",
  "TECH_STACK": "Технічний стек",
  "TH_LANG": "тайська",
  "TR_LANG": "турецька",
  "UK_LANG": "українська",
  "VI_LANG": "в'єтнамська",
  "WATER_ANALYSIS_UI": "Інтерфейс користувача аналізу води",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Реалізовано масштабовані модульні компоненти інтерфейсу користувача з використанням атомарного інтерфейсу користувача та модульної архітектури MVC для підтримки аналізу води в реальному часі та візуалізації вимірювань для внутрішніх інженерів, лаборантів і клієнтів.",
  "WORK_EXPERIENCE": "Досвід роботи",
  "ZH_LANG": "китайський"
}