{
  "ABOUT": "Về",
  "ABOUT_HEADLINE": "Tôi chuyên phát triển web, xây dựng các sản phẩm có khả năng mở rộng và hiệu suất cao với trải nghiệm người dùng liền mạch.",
  "ABOUT_ME": "Giới thiệu về tôi",
  "ABOUT_SUPPORTING_TEXT": "Với hơn bốn năm kinh nghiệm chuyên môn, tôi góp phần xây dựng các giải pháp phần mềm đáng tin cậy và hiệu quả. Công việc của tôi đã hỗ trợ các ứng dụng được các công ty Fortune 500 sử dụng, đảm bảo hiệu suất, khả năng mở rộng và khả năng bảo trì.",
  "APRIL_2025": "tháng 4 năm 2025",
  "AR_LANG": "tiếng Ả Rập",
  "BACKEND": "Phần phụ trợ",
  "BACKEND_DESCRIPTION": "Có kỹ năng phát triển API RESTful, viết và tối ưu hóa các truy vấn SQL phức tạp cũng như quản lý cơ sở dữ liệu quan hệ. Có kinh nghiệm tích hợp liền mạch giữa hệ thống frontend và backend cho các ứng dụng hiệu suất cao.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Màn hình hoạt động của trình quản lý pin",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Ứng dụng web được lập trình để hiển thị hoạt động bảo trì pin của trung tâm phân phối. Chạy trên các thiết bị Raspberry Pi. Hiển thị các hoạt động bảo trì pin theo thời gian thực cho các trung tâm phân phối dưới dạng biểu đồ và bảng tương tác.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Phát triển toàn bộ ứng dụng web cho các thiết bị được nhân viên trung tâm phân phối sử dụng để duy trì, theo dõi và xem số liệu thống kê về pin công nghiệp. Được sử dụng bởi một số công ty Fortune 500.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Trình quản lý pin Ứng dụng web cảm ứng trên máy tính",
  "BN_LANG": "tiếng Bengali",
  "CI_CD_DESCRIPTION": "Có kỹ năng hợp lý hóa các quy trình triển khai cho các giải pháp CI/CD có thể mở rộng và hiệu quả. Tận dụng GitHub Actions để triển khai và lưu trữ các ứng dụng React trên Amazon S3, cũng như triển khai các quy trình Jenkins tự động được tích hợp với Bitbucket để tối ưu hóa quy trình xây dựng, thử nghiệm và triển khai chương trình cơ sở.",
  "CONTRACT_FIRMWARE_ENGINEER": "Kỹ sư phần mềm hợp đồng",
  "CS_LANG": "tiếng Séc",
  "DA_LANG": "tiếng Đan Mạch",
  "DE_LANG": "tiếng Đức",
  "EGG_HARBOR_NJ_USA": "Thị trấn Egg Harbor, New Jersey, Hoa Kỳ",
  "EL_LANG": "tiếng Hy Lạp",
  "EN_LANG": "Tiếng Anh",
  "ES_LANG": "tiếng Tây Ban Nha",
  "EXPERIENCE": "Kinh nghiệm",
  "FI_LANG": "tiếng Phần Lan",
  "FIRMWARE_UI_DEVELOPMENT": "Phát triển giao diện người dùng chương trình cơ sở",
  "FORT_COLLINS_COLORADO": "Pháo đài Collins, Colorado",
  "FR_LANG": "người Pháp",
  "FRONTEND": "Giao diện người dùng",
  "FRONTEND_DESCRIPTION": "Có tay nghề cao trong phát triển giao diện người dùng, viết kịch bản web và kỹ thuật giao diện người dùng với chuyên môn sâu trong việc quản lý các đơn vị giao diện người dùng phức tạp, quy mô lớn bằng cách sử dụng các khung React, TypeScript, JavaScript và Lit. Dẫn đầu việc thiết kế và phân phối nhiều ứng dụng cấp doanh nghiệp hiện đang được sản xuất tại các công ty trong Fortune 500.",
  "HACH_EXPERIENCE_1": "Duy trì monorepo TypeScript + Lit quy mô lớn sử dụng kiến ​​trúc MVC và giao diện người dùng nguyên tử.",
  "HACH_EXPERIENCE_2": "Triển khai và quản lý các mô-đun con UI cho một số dự án, hỗ trợ hiển thị phân tích nước.",
  "HACH_EXPERIENCE_3": "Đã triển khai các quy tắc và cấu hình ESLint tùy chỉnh, đồng thời phát triển các thử nghiệm đơn vị Jest cho các thành phần giao diện người dùng.",
  "HI_LANG": "Tiếng Hindi",
  "HOME": "Trang chủ",
  "HU_LANG": "tiếng Hungary",
  "ID_LANG": "tiếng Indonesia",
  "IT_LANG": "người Ý",
  "JA_LANG": "tiếng Nhật",
  "JUNE_2021": "tháng 6 năm 2021",
  "KO_LANG": "Tiếng Hàn",
  "LOVELAND_CO_USA": "Loveland, Colorado, Hoa Kỳ",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pennsylvania, Hoa Kỳ",
  "NL_LANG": "tiếng Hà Lan",
  "NO_LANG": "Na Uy",
  "PHLSCI_EXPERIENCE_1": "Thiết kế, phát triển và thử nghiệm các thành phần phần mềm cho hệ thống Trình quản lý pin.",
  "PHLSCI_EXPERIENCE_2": "Thiết kế và phát triển các ứng dụng và GUI dựa trên web được nhân viên trung tâm phân phối sử dụng cho các khách hàng như Target, Uline và TJX.",
  "PHLSCI_EXPERIENCE_3": "Các hoạt động hỗ trợ hàng ngày, giải quyết các lỗi hệ thống, hỗ trợ các câu hỏi của khách hàng/trang web.",
  "PL_LANG": "Đánh bóng",
  "PRESENT": "Hiện tại",
  "PROJECTS": "Dự án",
  "PT_LANG": "tiếng Bồ Đào Nha",
  "REGULUS_EXPERIENCE_1": "Giao diện người dùng được nâng cấp cho cả yêu cầu nhập dữ liệu và xuất kết quả phân tích.",
  "REGULUS_EXPERIENCE_2": "Cải thiện hiệu quả cơ sở dữ liệu và thời gian quay vòng.",
  "REGULUS_EXPERIENCE_3": "Các trang web kiểu bảng điều khiển được phát triển hiển thị hiệu suất hệ thống lịch sử và thời gian thực tổng thể.",
  "RESUME": "Bản tóm tắt",
  "RO_LANG": "người Rumani",
  "RU_LANG": "tiếng Nga",
  "SEPTEMBER_2022": "tháng 9 năm 2022",
  "SOFTWARE_DEVELOPMENT": "Phát triển phần mềm",
  "SOFTWARE_ENGINEER": "Kỹ sư phần mềm",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Bảng điều khiển tiêu điểm giám sát",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Công cụ phần mềm được phát triển cho Cục Hàng không Liên bang (FAA). Công cụ hiển thị dữ liệu chuyến bay từ các nguồn dữ liệu khác nhau. Người dùng có thể chọn giữa dữ liệu hàng ngày và hàng tháng và dữ liệu được đưa vào bảng điều khiển tương tác.",
  "SV_LANG": "tiếng Thụy Điển",
  "TECH_STACK": "ngăn xếp công nghệ",
  "TH_LANG": "tiếng Thái",
  "TR_LANG": "tiếng Thổ Nhĩ Kỳ",
  "UK_LANG": "tiếng Ukraina",
  "VI_LANG": "Tiếng Việt",
  "WATER_ANALYSIS_UI": "Giao diện người dùng phân tích nước",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Triển khai các thành phần UI mô-đun, có thể mở rộng bằng cách sử dụng kiến ​​trúc Atomic UI và MVC mô-đun để hỗ trợ trực quan hóa phép đo và phân tích nước theo thời gian thực cho các kỹ sư nội bộ, kỹ thuật viên phòng thí nghiệm và khách hàng.",
  "WORK_EXPERIENCE": "Kinh nghiệm làm việc",
  "ZH_LANG": "Tiếng Trung"
}