{
  "ABOUT": "Hakkında",
  "ABOUT_HEADLINE": "Sorunsuz kullanıcı deneyimlerine sahip ölçeklenebilir ve yüksek performanslı ürünler oluşturma ve web geliştirme konusunda uzmanım.",
  "ABOUT_ME": "Hakkımda",
  "ABOUT_SUPPORTING_TEXT": "Dört yılı aşkın profesyonel deneyimim ile güvenilir ve verimli yazılım çözümleri oluşturmaya katkıda bulunuyorum. Çalışmalarım, Fortune 500 şirketlerinin kullandığı uygulamaları güçlendirerek performans, ölçeklenebilirlik ve sürdürülebilirlik sağladı.",
  "APRIL_2025": "Nisan 2025",
  "AR_LANG": "Arapça",
  "BACKEND": "Arka uç",
  "BACKEND_DESCRIPTION": "RESTful API geliştirme, karmaşık SQL sorgularını yazma ve optimize etme ve ilişkisel veritabanlarını yönetme becerisine sahip. Yüksek performanslı uygulamalar için ön uç ve arka uç sistemler arasında kusursuz entegrasyon konusunda deneyimli.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Pil Yöneticisi İşlemleri Ekranı",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Dağıtım merkezlerinin akü bakım faaliyetlerini gösterecek şekilde programlanmış web uygulaması. Raspberry Pi cihazlarda çalışır. Dağıtım merkezleri için gerçek zamanlı akü bakım faaliyetlerini etkileşimli grafikler ve tablolar halinde görüntüler.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Endüstriyel pillere ilişkin istatistikleri korumak, takip etmek ve görüntülemek için dağıtım merkezi çalışanları tarafından kullanılan cihazlara yönelik web uygulamasının tam yığın geliştirmesi. Birçok Fortune 500 şirketi tarafından kullanılıyor.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Pil Yöneticisi Dokunmatik Bilgisayar Web Uygulaması",
  "BN_LANG": "Bengalce",
  "CI_CD_DESCRIPTION": "Ölçeklenebilir ve verimli CI/CD çözümleri için dağıtım hatlarını düzene koyma becerisine sahip. Amazon S3'te React uygulamalarını dağıtmak ve barındırmak için GitHub Actions'dan faydalanmanın yanı sıra ürün yazılımı oluşturma, test etme ve dağıtım iş akışlarını optimize etmek için Bitbucket ile entegre otomatik Jenkins işlem hatlarını uygulama.",
  "CONTRACT_FIRMWARE_ENGINEER": "Sözleşme Firmware Mühendisi",
  "CS_LANG": "Çek",
  "DA_LANG": "Danimarka",
  "DE_LANG": "Almanca",
  "EGG_HARBOR_NJ_USA": "Egg Harbor İlçesi, New Jersey, ABD",
  "EL_LANG": "Yunan",
  "EN_LANG": "İngilizce",
  "ES_LANG": "İspanyol",
  "EXPERIENCE": "Deneyim",
  "FI_LANG": "Fince",
  "FIRMWARE_UI_DEVELOPMENT": "Firmware Kullanıcı Arayüzü Geliştirme",
  "FORT_COLLINS_COLORADO": "Fort Collins, Kolorado",
  "FR_LANG": "Fransızca",
  "FRONTEND": "Başlangıç ​​aşaması",
  "FRONTEND_DESCRIPTION": "React, TypeScript, JavaScript ve Lit çerçevelerini kullanarak karmaşık, büyük ölçekli UI monorepo'larını yönetme konusunda derin uzmanlığa sahip, ön uç geliştirme, web komut dosyası oluşturma ve UI mühendisliği konusunda son derece yetenekli. Fortune 500 şirketlerinde halihazırda üretimde olan çok sayıda kurumsal düzeyde uygulamanın tasarımına ve sunumuna öncülük etti.",
  "HACH_EXPERIENCE_1": "MVC ve atomik UI mimarisini kullanarak büyük ölçekli bir TypeScript + Lit monorepo'yu koruyun.",
  "HACH_EXPERIENCE_2": "Su analizi ekranlarını destekleyen çeşitli projeler için kullanıcı arayüzü alt modüllerini uygulayın ve yönetin.",
  "HACH_EXPERIENCE_3": "Özel ESLint kuralları ve yapılandırmaları uygulandı ve kullanıcı arayüzü bileşenleri için Jest birim testleri geliştirildi.",
  "HI_LANG": "Hintçe",
  "HOME": "Ev",
  "HU_LANG": "Macarca",
  "ID_LANG": "Endonezya dili",
  "IT_LANG": "İtalyan",
  "JA_LANG": "Japonca",
  "JUNE_2021": "Haziran 2021",
  "KO_LANG": "Korece",
  "LOVELAND_CO_USA": "Loveland, Colorado, ABD",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pensilvanya, ABD",
  "NL_LANG": "Flemenkçe",
  "NO_LANG": "Norveç",
  "PHLSCI_EXPERIENCE_1": "Battery Manager sistemleri için yazılım bileşenlerini tasarlayın, geliştirin ve test edin.",
  "PHLSCI_EXPERIENCE_2": "Target, Uline ve TJX gibi müşteriler için dağıtım merkezi çalışanlarının kullandığı web tabanlı uygulamaları ve GUI'leri tasarlamak ve geliştirmek.",
  "PHLSCI_EXPERIENCE_3": "Günlük destek faaliyetleri, sistem hatalarının çözülmesi, müşteri/site sorularına yardımcı olunması.",
  "PL_LANG": "Lehçe",
  "PRESENT": "Sunmak",
  "PROJECTS": "Projeler",
  "PT_LANG": "Portekizce",
  "REGULUS_EXPERIENCE_1": "Hem veri isteklerini girmek hem de analitik sonuçları çıkarmak için yükseltilmiş kullanıcı arayüzü.",
  "REGULUS_EXPERIENCE_2": "Geliştirilmiş veritabanı verimliliği ve geri dönüş süreleri.",
  "REGULUS_EXPERIENCE_3": "Genel gerçek zamanlı ve geçmiş sistem performansını gösteren kontrol paneli tarzı web sayfaları geliştirildi.",
  "RESUME": "Sürdürmek",
  "RO_LANG": "Romen",
  "RU_LANG": "Rusça",
  "SEPTEMBER_2022": "Eylül 2022",
  "SOFTWARE_DEVELOPMENT": "Yazılım Geliştirme",
  "SOFTWARE_ENGINEER": "Yazılım Mühendisi",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Gözetim Spotlight Kontrol Paneli",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Federal Havacılık İdaresi (FAA) için geliştirilen yazılım aracı. Araç, farklı veri kaynaklarından gelen uçuş verilerini görüntüler. Kullanıcılar günlük ve aylık veriler arasında seçim yapabilir ve veriler etkileşimli bir kontrol paneline doldurulur.",
  "SV_LANG": "İsveççe",
  "TECH_STACK": "Teknoloji Yığını",
  "TH_LANG": "Tay dili",
  "TR_LANG": "Türkçe",
  "UK_LANG": "Ukraynalı",
  "VI_LANG": "Vietnam",
  "WATER_ANALYSIS_UI": "Su Analizi Kullanıcı Arayüzü",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Dahili mühendisler, laboratuvar teknisyenleri ve müşteriler için gerçek zamanlı su analizini ve ölçüm görselleştirmesini desteklemek amacıyla Atomic UI ve Modüler MVC mimarisini kullanarak ölçeklenebilir, modüler UI bileşenleri uygulandı.",
  "WORK_EXPERIENCE": "İş Deneyimi",
  "ZH_LANG": "Çince"
}