{
  "ABOUT": "के बारे में",
  "ABOUT_HEADLINE": "मैं वेब विकास, सहज उपयोगकर्ता अनुभव के साथ स्केलेबल और उच्च प्रदर्शन वाले उत्पादों के निर्माण में विशेषज्ञ हूं।",
  "ABOUT_ME": "मेरे बारे में",
  "ABOUT_SUPPORTING_TEXT": "चार वर्षों से अधिक के पेशेवर अनुभव के साथ, मैं विश्वसनीय और कुशल सॉफ़्टवेयर समाधान बनाने में योगदान देता हूँ। मेरे काम ने फॉर्च्यून 500 कंपनियों द्वारा उपयोग किए जाने वाले अनुप्रयोगों को संचालित किया है, जो प्रदर्शन, स्केलेबिलिटी और रखरखाव सुनिश्चित करते हैं।",
  "APRIL_2025": "अप्रैल 2025",
  "AR_LANG": "अरबी",
  "BACKEND": "बैकएंड",
  "BACKEND_DESCRIPTION": "RESTful API विकास, जटिल SQL प्रश्नों को लिखने और अनुकूलित करने और संबंधपरक डेटाबेस प्रबंधित करने में कुशल। उच्च-प्रदर्शन अनुप्रयोगों के लिए फ्रंटएंड और बैकएंड सिस्टम के बीच सहज एकीकरण में अनुभवी।",
  "BATTERY_MANAGER_OPS_DISPLAY": "बैटरी प्रबंधक संचालन प्रदर्शन",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "वितरण केंद्रों की बैटरी रखरखाव गतिविधि प्रदर्शित करने के लिए प्रोग्राम किया गया वेब ऐप। रास्पबेरी पाई उपकरणों पर चलता है। वितरण केंद्रों के लिए वास्तविक समय की बैटरी रखरखाव गतिविधियों को इंटरैक्टिव ग्राफ़ और तालिकाओं में प्रदर्शित करता है।",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "औद्योगिक बैटरियों के आंकड़ों को बनाए रखने, ट्रैक करने और देखने के लिए वितरण केंद्र के कर्मचारियों द्वारा उपयोग किए जाने वाले उपकरणों के लिए वेब ऐप का पूर्ण स्टैक विकास। कई फॉर्च्यून 500 कंपनियों द्वारा उपयोग में।",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "बैटरी मैनेजर टच कंप्यूटर वेब ऐप",
  "BN_LANG": "बंगाली",
  "CI_CD_DESCRIPTION": "स्केलेबल और कुशल सीआई/सीडी समाधानों के लिए परिनियोजन पाइपलाइनों को सुव्यवस्थित करने में कुशल। अमेज़ॅन S3 पर रिएक्ट अनुप्रयोगों को तैनात और होस्ट करने के लिए GitHub क्रियाओं का लाभ उठाना, साथ ही फर्मवेयर निर्माण, परीक्षण और तैनाती वर्कफ़्लो को अनुकूलित करने के लिए Bitbucket के साथ एकीकृत स्वचालित जेनकींस पाइपलाइनों को लागू करना।",
  "CONTRACT_FIRMWARE_ENGINEER": "अनुबंध फ़र्मवेयर इंजीनियर",
  "CS_LANG": "चेक",
  "DA_LANG": "डेनिश",
  "DE_LANG": "जर्मन",
  "EGG_HARBOR_NJ_USA": "एग हार्बर टाउनशिप, न्यू जर्सी, यूएसए",
  "EL_LANG": "यूनानी",
  "EN_LANG": "अंग्रेज़ी",
  "ES_LANG": "स्पैनिश",
  "EXPERIENCE": "अनुभव",
  "FI_LANG": "फिनिश",
  "FIRMWARE_UI_DEVELOPMENT": "फ़र्मवेयर यूआई विकास",
  "FORT_COLLINS_COLORADO": "फोर्ट कॉलिन्स, कोलोराडो",
  "FR_LANG": "फ़्रेंच",
  "FRONTEND": "फ़्रंट एंड",
  "FRONTEND_DESCRIPTION": "रिएक्ट, टाइपस्क्रिप्ट, जावास्क्रिप्ट और लिट फ्रेमवर्क का उपयोग करके जटिल, बड़े पैमाने पर यूआई मोनोरेपो को प्रबंधित करने में गहरी विशेषज्ञता के साथ फ्रंटएंड डेवलपमेंट, वेब स्क्रिप्टिंग और यूआई इंजीनियरिंग में अत्यधिक कुशल। फॉर्च्यून 500 कंपनियों में वर्तमान में उत्पादन में कई एंटरप्राइज़-ग्रेड अनुप्रयोगों के डिजाइन और वितरण का नेतृत्व किया।",
  "HACH_EXPERIENCE_1": "एमवीसी और परमाणु यूआई आर्किटेक्चर का उपयोग करके बड़े पैमाने पर टाइपस्क्रिप्ट + लिट मोनोरेपो बनाए रखें।",
  "HACH_EXPERIENCE_2": "जल विश्लेषण डिस्प्ले का समर्थन करते हुए, कई परियोजनाओं के लिए यूआई सबमॉड्यूल को लागू और प्रबंधित करें।",
  "HACH_EXPERIENCE_3": "कस्टम ESLint नियम और कॉन्फ़िगरेशन लागू किए गए, और UI घटकों के लिए जेस्ट यूनिट परीक्षण विकसित किए गए।",
  "HI_LANG": "हिंदी",
  "HOME": "घर",
  "HU_LANG": "हंगेरी",
  "ID_LANG": "इन्डोनेशियाई",
  "IT_LANG": "इतालवी",
  "JA_LANG": "जापानी",
  "JUNE_2021": "जून 2021",
  "KO_LANG": "कोरियाई",
  "LOVELAND_CO_USA": "लवलैंड, कोलोराडो, संयुक्त राज्य अमेरिका",
  "MONTGOMERYVILLE_PA_USA": "मोंटगोमेरीविले, पेंसिल्वेनिया, संयुक्त राज्य अमेरिका",
  "NL_LANG": "डच",
  "NO_LANG": "नार्वेजियन",
  "PHLSCI_EXPERIENCE_1": "बैटरी मैनेजर सिस्टम के लिए सॉफ़्टवेयर घटकों को डिज़ाइन, विकसित और परीक्षण करें।",
  "PHLSCI_EXPERIENCE_2": "टारगेट, यूलाइन और टीजेएक्स जैसे ग्राहकों के लिए वितरण केंद्र के कर्मचारियों द्वारा उपयोग किए जाने वाले वेब-आधारित अनुप्रयोगों और जीयूआई को डिजाइन और विकसित करना।",
  "PHLSCI_EXPERIENCE_3": "दिन-प्रतिदिन की सहायता गतिविधियाँ, सिस्टम बग का समाधान करना, ग्राहक/साइट के प्रश्नों में सहायता करना।",
  "PL_LANG": "पोलिश",
  "PRESENT": "उपस्थित",
  "PROJECTS": "परियोजनाओं",
  "PT_LANG": "पुर्तगाली",
  "REGULUS_EXPERIENCE_1": "डेटा अनुरोधों को इनपुट करने और विश्लेषणात्मक परिणाम आउटपुट करने के लिए उन्नत उपयोगकर्ता इंटरफ़ेस।",
  "REGULUS_EXPERIENCE_2": "बेहतर डेटाबेस दक्षता और टर्नअराउंड समय।",
  "REGULUS_EXPERIENCE_3": "समग्र वास्तविक समय और ऐतिहासिक सिस्टम प्रदर्शन दिखाने वाले डैशबोर्ड शैली के वेब पेज विकसित किए गए।",
  "RESUME": "फिर शुरू करना",
  "RO_LANG": "रोमानियाई",
  "RU_LANG": "रूसी",
  "SEPTEMBER_2022": "सितंबर 2022",
  "SOFTWARE_DEVELOPMENT": "सॉफ्टवेयर डेवलपमेंट",
  "SOFTWARE_ENGINEER": "सॉफ्टवेयर इंजीनियर",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "निगरानी स्पॉटलाइट डैशबोर्ड",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "फेडरल एविएशन एडमिनिस्ट्रेशन (एफएए) के लिए सॉफ्टवेयर टूल विकसित किया गया। उपकरण विभिन्न डेटा स्रोतों से उड़ान डेटा प्रदर्शित करता है। उपयोगकर्ता दैनिक और मासिक डेटा के बीच चयन कर सकते हैं, और डेटा एक इंटरैक्टिव डैशबोर्ड में भर जाता है।",
  "SV_LANG": "स्वीडिश",
  "TECH_STACK": "टेक स्टैक",
  "TH_LANG": "थाई",
  "TR_LANG": "तुर्की",
  "UK_LANG": "यूक्रेनी",
  "VI_LANG": "वियतनामी",
  "WATER_ANALYSIS_UI": "जल विश्लेषण यूआई",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "आंतरिक इंजीनियरों, प्रयोगशाला तकनीशियनों और ग्राहकों के लिए वास्तविक समय जल विश्लेषण और माप विज़ुअलाइज़ेशन का समर्थन करने के लिए परमाणु यूआई और मॉड्यूलर एमवीसी आर्किटेक्चर का उपयोग करके स्केलेबल, मॉड्यूलर यूआई घटकों को कार्यान्वित किया गया।",
  "WORK_EXPERIENCE": "कार्य अनुभव",
  "ZH_LANG": "चीनी"
}