{
  "ABOUT": "Για",
  "ABOUT_HEADLINE": "Ειδικεύομαι στην ανάπτυξη ιστού, στη δημιουργία κλιμακούμενων και υψηλής απόδοσης προϊόντων με απρόσκοπτη εμπειρία χρήστη.",
  "ABOUT_ME": "Σχετικά με εμένα",
  "ABOUT_SUPPORTING_TEXT": "Με πάνω από τέσσερα χρόνια επαγγελματικής εμπειρίας, συμβάλλω στη δημιουργία αξιόπιστων και αποτελεσματικών λύσεων λογισμικού. Η δουλειά μου έχει τροφοδοτήσει εφαρμογές που χρησιμοποιούνται από εταιρείες του Fortune 500, διασφαλίζοντας απόδοση, επεκτασιμότητα και δυνατότητα συντήρησης.",
  "APRIL_2025": "Απρίλιος 2025",
  "AR_LANG": "αραβικός",
  "BACKEND": "Backend",
  "BACKEND_DESCRIPTION": "Ειδικός στην ανάπτυξη RESTful API, τη σύνταξη και τη βελτιστοποίηση σύνθετων ερωτημάτων SQL και τη διαχείριση σχεσιακών βάσεων δεδομένων. Έμπειρος στην απρόσκοπτη ενοποίηση μεταξύ συστημάτων frontend και backend για εφαρμογές υψηλής απόδοσης.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Εμφάνιση λειτουργιών Battery Manager",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Προγραμματισμένη εφαρμογή Ιστού για την εμφάνιση της δραστηριότητας συντήρησης μπαταρίας των κέντρων διανομής. Λειτουργεί σε συσκευές Raspberry Pi. Εμφανίζει τις δραστηριότητες συντήρησης μπαταρίας σε πραγματικό χρόνο για κέντρα διανομής σε διαδραστικά γραφήματα και πίνακες.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Ανάπτυξη πλήρους στοίβας εφαρμογής web για συσκευές που χρησιμοποιούνται από υπαλλήλους του κέντρου διανομής για τη συντήρηση, παρακολούθηση και προβολή στατιστικών στοιχείων για βιομηχανικές μπαταρίες. Σε χρήση από πολλές εταιρείες του Fortune 500.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Διαχειριστής μπαταρίας Αγγίξτε την εφαρμογή Web Computer",
  "BN_LANG": "Μπενγκάλι",
  "CI_CD_DESCRIPTION": "Ειδικευμένος στον εξορθολογισμό των αγωγών ανάπτυξης για επεκτάσιμες και αποτελεσματικές λύσεις CI/CD. Αξιοποιώντας το GitHub Actions για την ανάπτυξη και φιλοξενία εφαρμογών React στο Amazon S3, καθώς και την υλοποίηση αυτοματοποιημένων αγωγών Jenkins ενσωματωμένων στο Bitbucket για τη βελτιστοποίηση των ροών εργασιών κατασκευής υλικολογισμικού, δοκιμών και ανάπτυξης.",
  "CONTRACT_FIRMWARE_ENGINEER": "Συμβασιούχος Μηχανικός Υλικολογισμικού",
  "CS_LANG": "Τσέχος",
  "DA_LANG": "δανικός",
  "DE_LANG": "Γερμανός",
  "EGG_HARBOR_NJ_USA": "Egg Harbor Township, Νιου Τζέρσεϊ, ΗΠΑ",
  "EL_LANG": "ελληνικά",
  "EN_LANG": "αγγλικός",
  "ES_LANG": "ισπανικά",
  "EXPERIENCE": "Εμπειρία",
  "FI_LANG": "φινλανδικός",
  "FIRMWARE_UI_DEVELOPMENT": "Ανάπτυξη UI υλικολογισμικού",
  "FORT_COLLINS_COLORADO": "Φορτ Κόλινς, Κολοράντο",
  "FR_LANG": "Γάλλος",
  "FRONTEND": "Frontend",
  "FRONTEND_DESCRIPTION": "Υψηλή εξειδίκευση στην ανάπτυξη frontend, στο web scripting και στη μηχανική διεπαφής χρήστη με βαθιά εξειδίκευση στη διαχείριση πολύπλοκων, μεγάλης κλίμακας monorepos UI χρησιμοποιώντας πλαίσια React, TypeScript, JavaScript και Lit. Οδήγησε το σχεδιασμό και την παράδοση πολλαπλών εφαρμογών εταιρικής ποιότητας που παράγονται αυτήν τη στιγμή σε εταιρείες του Fortune 500.",
  "HACH_EXPERIENCE_1": "Διατηρήστε μια μεγάλης κλίμακας TypeScript + Lit monorepo που χρησιμοποιεί αρχιτεκτονική MVC και ατομική διεπαφή χρήστη.",
  "HACH_EXPERIENCE_2": "Υλοποιήστε και διαχειριστείτε υπομονάδες διεπαφής χρήστη για πολλά έργα, υποστηρίζοντας οθόνες ανάλυσης νερού.",
  "HACH_EXPERIENCE_3": "Εφάρμοσε προσαρμοσμένους κανόνες και διαμορφώσεις ESLint και ανέπτυξε δοκιμές ενότητας Jest για στοιχεία διεπαφής χρήστη.",
  "HI_LANG": "Χίντι",
  "HOME": "Σπίτι",
  "HU_LANG": "ουγγρικός",
  "ID_LANG": "Ινδονησιακά",
  "IT_LANG": "ιταλικά",
  "JA_LANG": "Ιαπωνικά",
  "JUNE_2021": "Ιούνιος 2021",
  "KO_LANG": "κορεάτης",
  "LOVELAND_CO_USA": "Loveland, Κολοράντο, ΗΠΑ",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Πενσυλβάνια, Η.Π.Α",
  "NL_LANG": "Ολλανδός",
  "NO_LANG": "Νορβηγική",
  "PHLSCI_EXPERIENCE_1": "Σχεδιασμός, ανάπτυξη και δοκιμή στοιχείων λογισμικού για συστήματα Battery Manager.",
  "PHLSCI_EXPERIENCE_2": "Σχεδιασμός και ανάπτυξη διαδικτυακών εφαρμογών και GUI που χρησιμοποιούνται από υπαλλήλους του κέντρου διανομής για πελάτες όπως οι Target, Uline και TJX.",
  "PHLSCI_EXPERIENCE_3": "Καθημερινές δραστηριότητες υποστήριξης, επίλυση σφαλμάτων συστήματος, βοήθεια με ερωτήσεις πελατών/ιστότοπων.",
  "PL_LANG": "Στίλβωση",
  "PRESENT": "Παρόν",
  "PROJECTS": "Έργα",
  "PT_LANG": "Πορτογάλος",
  "REGULUS_EXPERIENCE_1": "Αναβαθμισμένη διεπαφή χρήστη τόσο για την εισαγωγή αιτημάτων δεδομένων όσο και για την έξοδο αναλυτικών αποτελεσμάτων.",
  "REGULUS_EXPERIENCE_2": "Βελτιωμένη αποτελεσματικότητα της βάσης δεδομένων και χρόνοι διεκπεραίωσης.",
  "REGULUS_EXPERIENCE_3": "Αναπτύχθηκαν ιστοσελίδες τύπου πίνακα ελέγχου που δείχνουν τη συνολική απόδοση του συστήματος σε πραγματικό χρόνο και το ιστορικό.",
  "RESUME": "Περίληψη",
  "RO_LANG": "ρουμανικός",
  "RU_LANG": "ρωσικός",
  "SEPTEMBER_2022": "Σεπτέμβριος 2022",
  "SOFTWARE_DEVELOPMENT": "Ανάπτυξη Λογισμικού",
  "SOFTWARE_ENGINEER": "Μηχανικός Λογισμικού",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Πίνακας ελέγχου επιτήρησης Spotlight",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Εργαλείο λογισμικού που αναπτύχθηκε για την Ομοσπονδιακή Υπηρεσία Αεροπορίας (FAA). Το εργαλείο εμφανίζει δεδομένα πτήσης από διαφορετικές πηγές δεδομένων. Οι χρήστες μπορούν να επιλέξουν μεταξύ ημερήσιων και μηνιαίων δεδομένων και τα δεδομένα συμπληρώνονται σε έναν διαδραστικό πίνακα εργαλείων.",
  "SV_LANG": "σουηδικά",
  "TECH_STACK": "Tech Stack",
  "TH_LANG": "Ταϊλανδός",
  "TR_LANG": "τούρκικος",
  "UK_LANG": "Ουκρανική",
  "VI_LANG": "Βιετναμέζικο",
  "WATER_ANALYSIS_UI": "Διεπαφή χρήστη ανάλυσης νερού",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Εφαρμόστηκαν κλιμακούμενα, αρθρωτά στοιχεία διεπαφής χρήστη χρησιμοποιώντας αρχιτεκτονική Atomic UI και Modular MVC για υποστήριξη ανάλυσης νερού σε πραγματικό χρόνο και απεικόνισης μέτρησης για εσωτερικούς μηχανικούς, τεχνικούς εργαστηρίου και πελάτες.",
  "WORK_EXPERIENCE": "Εργασιακή Εμπειρία",
  "ZH_LANG": "κινέζικα"
}