{
  "ABOUT": "O",
  "ABOUT_HEADLINE": "Specializuji se na vývoj webových aplikací, vytváření škálovatelných a vysoce výkonných produktů s bezproblémovou uživatelskou zkušeností.",
  "ABOUT_ME": "O mně",
  "ABOUT_SUPPORTING_TEXT": "S více než čtyřletými odbornými zkušenostmi přispívám k budování spolehlivých a efektivních softwarových řešení. Moje práce pohání aplikace používané společnostmi z žebříčku Fortune 500, zajišťující výkon, škálovatelnost a udržovatelnost.",
  "APRIL_2025": "dubna 2025",
  "AR_LANG": "arabština",
  "BACKEND": "Backend",
  "BACKEND_DESCRIPTION": "Zkušenosti s vývojem RESTful API, psaním a optimalizací složitých SQL dotazů a správou relačních databází. Zkušenosti s bezproblémovou integrací mezi frontend a backend systémy pro vysoce výkonné aplikace.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Provozní displej správce baterie",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Naprogramovaná webová aplikace pro zobrazení aktivity údržby baterie distribučních center. Běží na zařízeních Raspberry Pi. Zobrazuje činnosti údržby baterie v reálném čase pro distribuční centra v interaktivních grafech a tabulkách.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Kompletní vývoj webové aplikace pro zařízení používaná zaměstnanci distribučních center k udržování, sledování a prohlížení statistik pro průmyslové baterie. Používá jej několik společností z žebříčku Fortune 500.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Battery Manager Touch Computer Web App",
  "BN_LANG": "bengálský",
  "CI_CD_DESCRIPTION": "Zkušení v zefektivňování zaváděcích kanálů pro škálovatelná a efektivní řešení CI/CD. Využití GitHub Actions k nasazení a hostování aplikací React na Amazon S3, stejně jako implementace automatizovaných Jenkins pipelines integrovaných s Bitbucket pro optimalizaci pracovních postupů sestavování, testování a nasazení firmwaru.",
  "CONTRACT_FIRMWARE_ENGINEER": "Smluvní firmwarový inženýr",
  "CS_LANG": "čeština",
  "DA_LANG": "dánština",
  "DE_LANG": "Němec",
  "EGG_HARBOR_NJ_USA": "Egg Harbor Township, New Jersey, USA",
  "EL_LANG": "řecký",
  "EN_LANG": "angličtina",
  "ES_LANG": "španělština",
  "EXPERIENCE": "Zažít",
  "FI_LANG": "finština",
  "FIRMWARE_UI_DEVELOPMENT": "Vývoj firmware UI",
  "FORT_COLLINS_COLORADO": "Fort Collins, Colorado",
  "FR_LANG": "francouzština",
  "FRONTEND": "Frontend",
  "FRONTEND_DESCRIPTION": "Vysoce kvalifikovaní v oblasti vývoje frontendu, webového skriptování a inženýrství uživatelského rozhraní s hlubokými odbornými znalostmi ve správě komplexních, rozsáhlých monorepozit uživatelského rozhraní pomocí rámců React, TypeScript, JavaScript a Lit. Vedl návrh a dodávku několika podnikových aplikací, které jsou v současnosti ve výrobě napříč společnostmi z žebříčku Fortune 500.",
  "HACH_EXPERIENCE_1": "Udržujte rozsáhlé monorepo TypeScript + Lit využívající MVC a atomickou architekturu uživatelského rozhraní.",
  "HACH_EXPERIENCE_2": "Implementujte a spravujte podmoduly uživatelského rozhraní pro několik projektů, které podporují zobrazení analýzy vody.",
  "HACH_EXPERIENCE_3": "Implementoval vlastní pravidla a konfigurace ESLint a vyvinul testy jednotek Jest pro komponenty uživatelského rozhraní.",
  "HI_LANG": "hindština",
  "HOME": "Domov",
  "HU_LANG": "maďarský",
  "ID_LANG": "indonéština",
  "IT_LANG": "italština",
  "JA_LANG": "japonský",
  "JUNE_2021": "června 2021",
  "KO_LANG": "korejština",
  "LOVELAND_CO_USA": "Loveland, Colorado, USA",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pennsylvania, USA",
  "NL_LANG": "holandský",
  "NO_LANG": "Norsko",
  "PHLSCI_EXPERIENCE_1": "Navrhujte, vyvíjejte a testujte softwarové komponenty pro systémy Battery Manager.",
  "PHLSCI_EXPERIENCE_2": "Navrhování a vývoj webových aplikací a GUI používaných zaměstnanci distribučních center pro klienty, jako jsou Target, Uline a TJX.",
  "PHLSCI_EXPERIENCE_3": "Každodenní podpůrné činnosti, řešení systémových chyb, pomoc s dotazy zákazníků/stránek.",
  "PL_LANG": "polština",
  "PRESENT": "Současnost",
  "PROJECTS": "Projekty",
  "PT_LANG": "portugalština",
  "REGULUS_EXPERIENCE_1": "Vylepšené uživatelské rozhraní pro zadávání požadavků na data a výstup analytických výsledků.",
  "REGULUS_EXPERIENCE_2": "Zlepšená databázová efektivita a doba obratu.",
  "REGULUS_EXPERIENCE_3": "Vyvinuté webové stránky ve stylu řídicího panelu zobrazující celkový výkon systému v reálném čase a v minulosti.",
  "RESUME": "Resumé",
  "RO_LANG": "rumunština",
  "RU_LANG": "ruština",
  "SEPTEMBER_2022": "září 2022",
  "SOFTWARE_DEVELOPMENT": "Vývoj softwaru",
  "SOFTWARE_ENGINEER": "softwarový inženýr",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Dashboard hlídacího reflektoru",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Softwarový nástroj vyvinutý pro Federal Aviation Administration (FAA). Nástroj zobrazuje letová data z různých zdrojů dat. Uživatelé si mohou vybrat mezi denními a měsíčními daty a data se naplní do interaktivního řídicího panelu.",
  "SV_LANG": "švédský",
  "TECH_STACK": "Tech Stack",
  "TH_LANG": "thajština",
  "TR_LANG": "turečtina",
  "UK_LANG": "ukrajinský",
  "VI_LANG": "vietnamština",
  "WATER_ANALYSIS_UI": "Analýza vody UI",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Implementované škálovatelné modulární komponenty uživatelského rozhraní využívající architekturu Atomic UI a modulární MVC pro podporu analýzy vody a vizualizace měření v reálném čase pro interní inženýry, laboratorní techniky a klienty.",
  "WORK_EXPERIENCE": "Pracovní zkušenosti",
  "ZH_LANG": "čínština"
}