{
  "ABOUT": "Om",
  "ABOUT_HEADLINE": "Jeg er specialiseret i webudvikling, opbygning af skalerbare og højtydende produkter med problemfri brugeroplevelse.",
  "ABOUT_ME": "Om mig",
  "ABOUT_SUPPORTING_TEXT": "Med over fire års erhvervserfaring bidrager jeg til at bygge pålidelige og effektive softwareløsninger. Mit arbejde har drevet applikationer brugt af Fortune 500-virksomheder, hvilket sikrer ydeevne, skalerbarhed og vedligeholdelse.",
  "APRIL_2025": "april 2025",
  "AR_LANG": "arabisk",
  "BACKEND": "Backend",
  "BACKEND_DESCRIPTION": "Dygtig i RESTful API-udvikling, skrivning og optimering af komplekse SQL-forespørgsler og styring af relationelle databaser. Erfaren i problemfri integration mellem frontend- og backend-systemer til højtydende applikationer.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Battery Manager Operations Display",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Programmeret webapp til at vise distributionscentres batterivedligeholdelsesaktivitet. Kører på Raspberry Pi-enheder. Viser batterivedligeholdelsesaktiviteter i realtid for distributionscentre i interaktive grafer og tabeller.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Fuldstackudvikling af webapp til enheder, der bruges af distributionscentermedarbejdere til at vedligeholde, spore og se statistik for industribatterier. I brug af flere Fortune 500-virksomheder.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Battery Manager Touch Computer Web App",
  "BN_LANG": "bengalsk",
  "CI_CD_DESCRIPTION": "Erfaren i at strømline implementeringspipelines til skalerbare og effektive CI/CD-løsninger. Udnyttelse af GitHub Actions til at implementere og hoste React-applikationer på Amazon S3, samt implementere automatiserede Jenkins-pipelines integreret med Bitbucket for at optimere firmwarebuilding, -testning og -implementeringsworkflows.",
  "CONTRACT_FIRMWARE_ENGINEER": "Kontrakt firmware ingeniør",
  "CS_LANG": "tjekkisk",
  "DA_LANG": "dansk",
  "DE_LANG": "tysk",
  "EGG_HARBOR_NJ_USA": "Egg Harbor Township, New Jersey, USA",
  "EL_LANG": "græsk",
  "EN_LANG": "engelsk",
  "ES_LANG": "spansk",
  "EXPERIENCE": "Erfaring",
  "FI_LANG": "finsk",
  "FIRMWARE_UI_DEVELOPMENT": "Firmware UI udvikling",
  "FORT_COLLINS_COLORADO": "Fort Collins, Colorado",
  "FR_LANG": "fransk",
  "FRONTEND": "Frontend",
  "FRONTEND_DESCRIPTION": "Højt kvalificeret inden for frontend-udvikling, webscripting og UI-teknik med dyb ekspertise i håndtering af komplekse, store UI-monorepos ved hjælp af React, TypeScript, JavaScript og Lit frameworks. Ledet design og levering af flere enterprise-grade applikationer, der i øjeblikket er i produktion på tværs af Fortune 500-virksomheder.",
  "HACH_EXPERIENCE_1": "Oprethold en storstilet TypeScript + Lit monorepo ved at bruge MVC og atomic UI-arkitektur.",
  "HACH_EXPERIENCE_2": "Implementer og administrer UI-undermoduler til flere projekter, der understøtter skærme for vandanalyse.",
  "HACH_EXPERIENCE_3": "Implementerede tilpassede ESLint-regler og -konfigurationer og udviklede Jest-enhedstests til UI-komponenter.",
  "HI_LANG": "hindi",
  "HOME": "Hjem",
  "HU_LANG": "ungarsk",
  "ID_LANG": "indonesisk",
  "IT_LANG": "italiensk",
  "JA_LANG": "japansk",
  "JUNE_2021": "juni 2021",
  "KO_LANG": "koreansk",
  "LOVELAND_CO_USA": "Loveland, Colorado, USA",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pennsylvania, USA",
  "NL_LANG": "hollandsk",
  "NO_LANG": "norsk",
  "PHLSCI_EXPERIENCE_1": "Design, udvikle og test softwarekomponenter til Battery Manager-systemer.",
  "PHLSCI_EXPERIENCE_2": "Design og udvikling af webbaserede applikationer og GUI'er, der bruges af distributionscentermedarbejdere til kunder som Target, Uline og TJX.",
  "PHLSCI_EXPERIENCE_3": "Dag til dag supportaktiviteter, løsning af systemfejl, assistance med kunde/site spørgsmål.",
  "PL_LANG": "Polere",
  "PRESENT": "Nuværende",
  "PROJECTS": "Projekter",
  "PT_LANG": "portugisisk",
  "REGULUS_EXPERIENCE_1": "Opgraderet brugergrænseflade til både input af dataanmodninger og udlæsning af analytiske resultater.",
  "REGULUS_EXPERIENCE_2": "Forbedret databaseeffektivitet og ekspeditionstid.",
  "REGULUS_EXPERIENCE_3": "Udviklede websider i dashboard-stil, der viser overordnet systemydelse i realtid og historisk.",
  "RESUME": "Genoptage",
  "RO_LANG": "rumænsk",
  "RU_LANG": "russisk",
  "SEPTEMBER_2022": "september 2022",
  "SOFTWARE_DEVELOPMENT": "Softwareudvikling",
  "SOFTWARE_ENGINEER": "Softwareingeniør",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Overvågning Spotlight Dashboard",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Softwareværktøj udviklet til Federal Aviation Administration (FAA). Værktøjet viser flydata fra forskellige datakilder. Brugere kan vælge mellem daglige og månedlige data, og dataene udfyldes i et interaktivt dashboard.",
  "SV_LANG": "svensk",
  "TECH_STACK": "Tech Stack",
  "TH_LANG": "Thai",
  "TR_LANG": "tyrkisk",
  "UK_LANG": "ukrainsk",
  "VI_LANG": "vietnamesisk",
  "WATER_ANALYSIS_UI": "Vandanalyse UI",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Implementeret skalerbare, modulære UI-komponenter ved hjælp af Atomic UI og Modular MVC-arkitektur til at understøtte real-time vandanalyse og målingsvisualisering for interne ingeniører, laboratorieteknikere og kunder.",
  "WORK_EXPERIENCE": "Erhvervserfaring",
  "ZH_LANG": "kinesisk"
}