{
  "ABOUT": "Sobre",
  "ABOUT_HEADLINE": "Sou especializado em desenvolvimento web, construindo produtos escaláveis ​​e de alto desempenho com experiências de usuário perfeitas.",
  "ABOUT_ME": "Sobre mim",
  "ABOUT_SUPPORTING_TEXT": "Com mais de quatro anos de experiência profissional, contribuo para a construção de soluções de software confiáveis ​​e eficientes. Meu trabalho potencializou aplicativos usados ​​por empresas da Fortune 500, garantindo desempenho, escalabilidade e facilidade de manutenção.",
  "APRIL_2025": "Abril de 2025",
  "AR_LANG": "árabe",
  "BACKEND": "Back-end",
  "BACKEND_DESCRIPTION": "Hábil no desenvolvimento de API RESTful, escrevendo e otimizando consultas SQL complexas e gerenciando bancos de dados relacionais. Experiente em integração perfeita entre sistemas frontend e backend para aplicações de alto desempenho.",
  "BATTERY_MANAGER_OPS_DISPLAY": "Exibição de operações do gerenciador de bateria",
  "BATTERY_MANAGER_OPS_DISPLAY_SUPPORTING_TEXT": "Aplicativo web programado para exibir a atividade de manutenção de baterias dos centros de distribuição. Funciona em dispositivos Raspberry Pi. Exibe atividades de manutenção de baterias em tempo real para centros de distribuição em gráficos e tabelas interativos.",
  "BATTERY_MANAGER_TC_APP_SUPPORTING_TEXT": "Desenvolvimento full stack de aplicativos web para dispositivos usados ​​por funcionários de centros de distribuição para manter, rastrear e visualizar estatísticas de baterias industriais. Em uso por várias empresas da Fortune 500.",
  "BATTERY_MANAGER_TOUCH_COMPUTER_APP": "Gerenciador de bateria Touch Computer Web App",
  "BN_LANG": "bengali",
  "CI_CD_DESCRIPTION": "Hábil em simplificar pipelines de implantação para soluções de CI/CD escalonáveis ​​e eficientes. Aproveitar o GitHub Actions para implantar e hospedar aplicativos React no Amazon S3, bem como implementar pipelines Jenkins automatizados integrados ao Bitbucket para otimizar fluxos de trabalho de construção, teste e implantação de firmware.",
  "CONTRACT_FIRMWARE_ENGINEER": "Engenheiro de firmware de contrato",
  "CS_LANG": "Tcheco",
  "DA_LANG": "dinamarquês",
  "DE_LANG": "Alemão",
  "EGG_HARBOR_NJ_USA": "Egg Harbor Township, Nova Jersey, EUA",
  "EL_LANG": "grego",
  "EN_LANG": "Inglês",
  "ES_LANG": "Espanhol",
  "EXPERIENCE": "Experiência",
  "FI_LANG": "finlandês",
  "FIRMWARE_UI_DEVELOPMENT": "Desenvolvimento de interface de firmware",
  "FORT_COLLINS_COLORADO": "Forte Collins, Colorado",
  "FR_LANG": "Francês",
  "FRONTEND": "Front-end",
  "FRONTEND_DESCRIPTION": "Altamente qualificado em desenvolvimento de front-end, scripts web e engenharia de UI, com profundo conhecimento no gerenciamento de monorepos de UI complexos e de grande escala usando estruturas React, TypeScript, JavaScript e Lit. Liderei o design e a entrega de vários aplicativos de nível empresarial atualmente em produção em empresas da Fortune 500.",
  "HACH_EXPERIENCE_1": "Mantenha um monorepo TypeScript + Lit em grande escala utilizando MVC e arquitetura de UI atômica.",
  "HACH_EXPERIENCE_2": "Implemente e gerencie submódulos de UI para diversos projetos, suportando exibições de análise de água.",
  "HACH_EXPERIENCE_3": "Implementou regras e configurações ESLint personalizadas e desenvolveu testes de unidade Jest para componentes de UI.",
  "HI_LANG": "hindi",
  "HOME": "Lar",
  "HU_LANG": "húngaro",
  "ID_LANG": "indonésio",
  "IT_LANG": "italiano",
  "JA_LANG": "japonês",
  "JUNE_2021": "Junho de 2021",
  "KO_LANG": "coreano",
  "LOVELAND_CO_USA": "Loveland, Colorado, EUA",
  "MONTGOMERYVILLE_PA_USA": "Montgomeryville, Pensilvânia, EUA",
  "NL_LANG": "Holandês",
  "NO_LANG": "Norueguês",
  "PHLSCI_EXPERIENCE_1": "Projetar, desenvolver e testar componentes de software para sistemas Battery Manager.",
  "PHLSCI_EXPERIENCE_2": "Projetar e desenvolver aplicativos baseados na web e GUIs usados ​​por funcionários de centros de distribuição para clientes como Target, Uline e TJX.",
  "PHLSCI_EXPERIENCE_3": "Atividades de suporte diário, resolvendo bugs do sistema, auxiliando nas dúvidas do cliente/local.",
  "PL_LANG": "polonês",
  "PRESENT": "Presente",
  "PROJECTS": "Projetos",
  "PT_LANG": "Português",
  "REGULUS_EXPERIENCE_1": "Interface de usuário atualizada para entrada de solicitações de dados e saída de resultados analíticos.",
  "REGULUS_EXPERIENCE_2": "Melhor eficiência do banco de dados e tempos de resposta.",
  "REGULUS_EXPERIENCE_3": "Desenvolvi páginas da web em estilo de painel mostrando o desempenho geral do sistema em tempo real e histórico.",
  "RESUME": "Retomar",
  "RO_LANG": "romeno",
  "RU_LANG": "russo",
  "SEPTEMBER_2022": "Setembro de 2022",
  "SOFTWARE_DEVELOPMENT": "Desenvolvimento de software",
  "SOFTWARE_ENGINEER": "Engenheiro de software",
  "SURVEILLANCE_SPOTLIGHT_DASHBOARD": "Painel de vigilância em destaque",
  "SURVEILLANCE_SPOTLIGHT_SUPPORTING_TEXT": "Ferramenta de software desenvolvida para a Federal Aviation Administration (FAA). A ferramenta exibe dados de voo de diferentes fontes de dados. Os usuários podem escolher entre dados diários e mensais, e os dados são preenchidos em um painel interativo.",
  "SV_LANG": "sueco",
  "TECH_STACK": "Pilha de tecnologia",
  "TH_LANG": "Tailandês",
  "TR_LANG": "turco",
  "UK_LANG": "Ucraniano",
  "VI_LANG": "vietnamita",
  "WATER_ANALYSIS_UI": "IU de análise de água",
  "WATER_ANALYSIS_UI_SUPPORTING_TEXT": "Implementou componentes de UI modulares e escaláveis ​​usando Atomic UI e arquitetura Modular MVC para dar suporte à análise de água em tempo real e visualização de medição para engenheiros internos, técnicos de laboratório e clientes.",
  "WORK_EXPERIENCE": "Experiência Profissional",
  "ZH_LANG": "chinês"
}